{
  "title": {
    "0": "AUTHORISED TRANSLATIONS OF ELECTRONIC DOCUMENTS",
    "1": "TRUSTED COMPUTING IN MOBILE ACTION",
    "2": "TOWARDS SECURITY EVALUATION BASED ON EVIDENCE COLLECTION",
    "3": "THE PECULIUM MODEL: INFORMATION SECURITY RISK MANAGEMENT FOR THE SOUTH AFRICAN SMME",
    "4": "A FRAMEWORK FOR EVALUATING ICT SECURITY AWARENESS ",
    "5": "DENIAL-OF-SERVICE & DISTRIBUTED DENIAL-OF-SERVICE ON THE INTERNET",
    "6": "TICKET BASED IDENTITY SYSTEM FOR DRM",
    "7": "UNDERSTANDING INFORMATION SECURITY CULTURE: A CONCEPTUAL FRAMEWORK",
    "8": "A SOCIAL-TECHNICAL VIEW OF ICT SECURITY ISSUES, TRENDS, AND CHALLENGES: TOWARDS A CULTURE OF ICT SECURITY—THE CASE OF TANZANIA",
    "9": "CASE STUDY OF THE USAGE OF AN AUTHENTICATION AND AUTHORIZATION INFRASTRUCTURE (AAI) IN AN ELEARNING PROJECT",
    "10": "OUTSOURCING ICT SECURITY TO MSSP: ISSUES AND CHALLENGES FOR THE DEVELOPING WORLD",
    "11": "CALCULATING COMPLIANCE STANDARDS",
    "12": "SECURITY RISK ANALYSIS FOR COMPLEX SYSTEMS",
    "13": "IDENTIFYING AND INVESTIGATING INTRUSIVE SCANNING PATTERNS BY VISUALIZING NETWORK TELESCOPE TRAFFIC IN A 3-D SCATTER-PLOT",
    "14": "A MODEL FOR SECURE VALUE-ADDED SERVICE SUBSCRIPTIONS IN CELLULAR NETWORKS",
    "15": "MONTHLY PATCH RELEASE SCHEDULES: DO THE BENEFITS OUTWEIGH THE RISKS?",
    "16": "THE NEED FOR CENTRALISED, CROSS PLATFORM INFORMATION AGGREGATION",
    "17": "PERFORMANCE ANALYSIS OF A SECURE SEAMLESS HANDOVER MECHANISM IN ALL-IP NETWORKS",
    "18": "INTEGRATING SECURE RTP INTO THE OPEN SOURCE VOIP PBX ASTERISK",
    "19": "A LOW BIT ARCHITECTURE FOR A VERY COMPACT HARDWARE IMPLEMENTATION OF THE AES ALGORITHM",
    "20": "TOWARDS REGULATORY COMPLIANCE A MODEL FOR THE SOUTH AFRICAN FINANCIAL SECTOR",
    "21": "A PROFILE OF THE DISTANCE COMPUTING STUDENT SOFTLIFTER",
    "22": "THE ORGANISATIONAL INFORMATION SECURITY PROFILE A TOOL TO ASSIST THE BOARD",
    "23": "On bidder zones, cell phones and ballot stuffing"
  },
  "abstracts": {
    "0": "AUTHORISED TRANSLATIONS OF ELECTRONIC DOCUMENTS A concept is proposed to extend authorised translations of documents to electronically signed, digital documents. Central element of the solution is an electronic seal, embodied as an XML data structure, which attests to the correctness of the translation and the authorisation of the translator. The seal contains a digital signature binding together original and translated document, thus enabling forensic inspection and therefore legal security in the appropriation of the translation. Organisational aspects of possible implementation variants of electronic authorised translations are discussed and a realisation as a stand-alone web-service is presented",
    "1": "TRUSTED COMPUTING IN MOBILE ACTION Due to the convergence of various mobile access technologies like UMTS, WLAN, and WiMax the need for a new supporting infrastructure arises. This infrastructure should be able to support more efficient ways to authenticate users and devices, potentially enabling novel services based on the security provided by the infrastructure. In this paper we exhibit some usage scenarios from the mobile domain integrating trusted computing, which show that trusted computing offers new paradigms for implementing trust and by this enables new technical applications and business scenarios. The scenarios show how the traditional boundaries between technical and authentication domains become permeable while a high security level is maintained.",
    "2": "TOWARDS SECURITY EVALUATION BASED ON EVIDENCE COLLECTION Information security evaluation of software-intensive systems typically relies heavily on the experience of the security professionals. Obviously, automated approaches are needed in this field. Unfortunately, there is no practical approach to carrying out security evaluation in a systematic way. Here we introduce a general-level holistic framework for security evaluation based on security behaviour modelling and security evidence collection, and discuss its applicability to the design of security evaluation experimentation setups in real-world systems",
    "3": "THE PECULIUM MODEL: INFORMATION SECURITY RISK MANAGEMENT FOR THE SOUTH AFRICAN SMME Small, medium and micro enterprises (SMMEs) in South Africa contribute over 40% to the gross domestic product. However, these organisations have a failure rate of 80%, mostly due to a lack of management skills. SMMEs also do not aspire to corporate governance standards for these management skills due to the lack of awareness of corporate governance best practice as well as the non-enforced implementation of King II by SMMEs. Risk management, as a component of King II, is consequently also optional, thus creating a lack of enforced information security risk management. The Peculium Model has been created for the small business environment in South Africa, specifically for the analysis and management of information security risks. The model is based on a framework derived from the examination of the risk management component of King II, CobiT for control of risk management, OCTAVE for asset-based risk management, CRAMM for monitoring of risk mitigation and ISO 17799 for cyclical risk management. The composition of the model allows for SMMEs and also ensures a distinctive link between board-level management and the risk management team implementing the model. Nevertheless, the model is in a simplified format, allowing the layperson to achieve results. The model has been tested and validated using a case study. The Peculium Model includes best practices from endorsed international standards. It provides a solution that offers a heightened awareness of risk in the organisation through staff involvement and board-level governance of the entire process. This paper presents the route followed in creating the model, and the validation performed to demonstrate its value.",
    "4": "A FRAMEWORK FOR EVALUATING ICT SECURITY AWARENESS ICT resources are important assets of any organization and the protection of these resources are equally important. To be able to protect themselves and their profitability, many organizations have established information security awareness programs. In order for a security awareness program to add value to an organization and at the same time make a contribution to the field of information security it is necessary to have a set of methods to study and measure its effect. This paper gives an overview of a suggested framework for evaluating ICT security awareness. Following a brief description of the framework, a more detailed overview on the identification of areas to be evaluated, using a value focused assessment, will be presented. Comments on possible system generated information, that may be used to assist with the evaluation of security behavior of users, will also be presented.",
    "5": "DENIAL-OF-SERVICE & DISTRIBUTED DENIAL-OF-SERVICE ON THE INTERNET Denial-of-Service and Distributed Denial-of-Service is costing the economy world-wide billions of dollars. The economy is the cornerstone of our society and its collapse will certainly change the way in which humanity exists today. The three main goals of computer security are availability, confidentiality and integrity. The focus of this paper is on attacks that compromise the availability of systems. A Denial-of-Service attack is a very serious threat to the infrastructure of the Internet, as well as its users. The Internet plays an important role in our everyday lives and many companies are dependent on it to conduct business or provide critical real-time services and cannot function when computer systems and network access go down. When a company cannot offer its services it will lose money, its reputation and ultimately clients. This in turn will impact the economy and eventually all of us. This is the major driver for network security requirements. In order to prevent these attacks from happening we need to understand what exactly the terms Denial-of-Service and Distributed Denial-of-Service mean and how they effect or impact the economy. This paper is a summary of a literature study, with regards to the causes and effects of these attacks, as well as potential solutions to the problem",
    "6": "TICKET BASED IDENTITY SYSTEM FOR DRM One of the major stumbling blocks in achieving interoperability in DRM systems is due to the variety of different user authentication systems utilised by DRM systems. For example, in [6], the authors detailed how Microsoft’s Rights Management System fails in fulfilling its requirements mainly because of a lack of its user identity system. The authors discussed how, because one DRM system cannot authenticate users from another DRM system, it cannot offer interoperability, even if they shared the same data formats. Furthermore, interoperability for user authentication in DRM systems is further hampered by the wide range of devices that need to support DRM enabled data, but do not necessarily offer the same features. Decoupling of user identity from the main DRM system also reduces the chances of correlating users’ access patterns of protected works. This improves the privacy of users of DRM systems, another major criticisms of current DRM systems. In this paper we discuss the requirements for user identity in a DRM system and then introduce a Kerberos like reusable ticket based user identity system. This system allows multiple systems to be authenticated by the use of time limited authentication tickets, without requiring online authentication. Tickets can be stored at a central controlling point, which is also responsible for acquiring tickets from authentication servers and redistributing tickets to the devices that need the tickets. In our experience, our approach fulfils all the requirements and is a more scalable and inter-operable approach when compared to existing DRM systems",
    "7": "UNDERSTANDING INFORMATION SECURITY CULTURE: A CONCEPTUAL FRAMEWORK The importance of establishing an information security culture in an organization has become a well established idea. The aim of such a culture is to address the various human factors that can affect an organization’s overall information security efforts. However, understanding both the various elements of an information security culture, as well as the relationships between these elements, can still be problematic. Schein’s definition of a corporate culture is often used to aid understanding of an information security culture. This paper briefly introduces Schein’s model. It then incorporates the important role knowledge plays in information security into this definition. Finally, a conceptual framework to aid understanding of the interactions between the various elements of such a culture, is presented. This framework is explained by means of illustrative examples, and it is suggested that this conceptual framework can be a useful aid to understanding information security culture",
    "8": "A SOCIAL-TECHNICAL VIEW OF ICT SECURITY ISSUES, TRENDS, AND CHALLENGES: TOWARDS A CULTURE OF ICT SECURITY—THE CASE OF TANZANIA This paper discusses the human dimension in a ‘security chain’ within information systems and networks. This dimension is often overlooked at different stages and levels of ICT development and implementation. An example of this omission could happen at the stages of design and implementation of various ICT systems or strategies and policy formulation concerning ICT use; at the level of an organisation or a country as a whole. As a consequence, this human dimension then forms a weak link in the overall ICT security chain. A common insight in this respect is that, a chain is as strong as its weakest link. A security chain involves coordinated measures both technical and non-technical (socialtechnical) necessarily taken to enable the provision and maintenance of adequate levels of ICT security within organisations or a nation as a whole. Several studies in the literature have shown that a supportive security culture is an important component in this chain. Security culture encompasses all socio-cultural measures that complement technical security measures. This paper will, drawing on available literature, attempt to identify and characterise the building blocks of a secure ICT environment in an organisation. The identified building blocks consist of: — people, ICT security requirements, ICT security culture, and security systems. Focusing on people, a discussion of the interaction between these building blocks in a social-technical context is provided based on some concepts from specific theories of Organisational Behaviour (OB). The building blocks and their interactions are then organized into a primary model. In order for an organisation to create, maintain and change its ICT security culture, certain enabling factors and changes at the national level are instrumental and necessary. Taking a socialtechnical context of Tanzania, the developed model is used to highlight and analyse some of these factors and needed changes in the light of some collected survey data. In particular, the current trends of ICT developments with respect to security and a supporting human capital are analysed. Further, recommendations of future strategies for ICT development in the country with respect to ICT security are also provided. This paper constitutes a part of an ongoing research from which we present some results",
    "9": "CASE STUDY OF THE USAGE OF AN AUTHENTICATION AND AUTHORIZATION INFRASTRUCTURE (AAI) IN AN ELEARNING PROJECT Authentication and Authorization Infrastructures (AAIs) are single sign-on systems. Their purpose is authenticating a user once, i.e. locally at the user’s so-called home organization, and then checking authorization of requested resource accesses based on user attributes the user’s home organization delivers. AAIs are just about being widely employed, and Switzerland is playing a pioneering role in AAI deployment as the national research and education network provider SWITCH has managed to get all Swiss universities involved in setting up an AAI. In that context, the SWITCH AAI is used, for instance, to control access to e-learning resources. We will report in this paper on SWITCH AAI and its use in the VITELS (Virtual Internet and Telecommunications Laboratory for Switzerland). By doing so, we will discuss how the AAI middleware Shibboleth is used to implement a concrete AAI. After explaining how Shibboleth is used to implement SWITCH AAI, we will discuss how VITELS integrates into SWITCH AAI, including server (or better: service) integration of VITELS into SWITCH AAI as well as discussing which attributes are delivered cross organizations.",
    "10": "OUTSOURCING ICT SECURITY TO MSSP: ISSUES AND CHALLENGES FOR THE DEVELOPING WORLD The overall use and development of ICT in developing countries has been faced with a wide range of constraints and challenges. These constraints may concern culture, infrastructure and education, and involve social, legal, political or economic issues. Numerous problems related to each of these issues have been observed. The problems may include, for example the absence of ICT policies, implementation procedures, a general lack of appropriate knowledge of ICT (among suppliers, managers, planners and users), too few trained /skilled ICT personnel or simply budget constraints. Among the critical issues that call for immediate attention and action are the security of information assets and processing systems. ICT security management poses a big challenge given the range of constraints mentioned and is critical for the trust and normal functioning of the various ICTs deployed. As is widely known, ICT security management process needs a holistic approach with experienced personnel, right policy and procedures, and the right technology. It also requires continuous monitoring and continuous threat intelligence in order to achieve and maintain sufficient security in an organisation. It follows then that achieving adequate ICT security management is a big challenge especially for organisations whose core services is not ICT. The idea behind outsourcing ICT security is based on the assumption that engaging a managed ICT security provider may be of great importance to such organisations, in that, like insurance, they will be relieved of their ICT security burden by transferring it to a third party. Given these presumptions many organisations worldwide may consider outsourcing their security services as a way forward in managing ICT security. However, the decision to outsource is never straightforward and is influenced by various constraints as mentioned above. Based on some empirical data, this paper describes typical characteristics of a developing country’s ICT environment from an ICT security management point of view and then discusses the suitability of the environment to benefit from outsourcing managed ICT security services. Use is made of the general merits of ICT security outsourcing as described in the numerous literature to discuss specific issues and challenges in this process that are believed to be necessary if the ICT security services outsourcing paradigm is to be adopted in developing countries with similar characteristics as those described in this paper",
    "11": "CALCULATING COMPLIANCE STANDARDS The security of information is important to protect top secret documents for government and private organisations alike. For this reason, many methods have been developed to enforce security and protect access to documents, computers and networks. Some of these methods include policies and procedures. These policies and procedures are compiled according to an Information Security Architecture (ISA). Information security standards help organisations reduce the risk of attacks by stipulating specific measures that should be implemented. These measures will help organisations to be secure from attacks, law suites, breaches, and more. The problem, however, is that there is no standard method that allows researchers, auditors, and academia to calculate the compliance to security standards or the state of information security. This article investigates methods and calculations proposed by other authors to determine compliance. Following on what has been done in the field, this article proposes a procedure that culminates in an information security compliance measure that appears to be standardised over different standards and in different scenarios. This procedure includes well-defined and trusted statistical formulae to calculate the compliance factor. Researchers and academia can use these formulae to standardise the calculation of compliance and to determine the state of information security in comparable terms",
    "12": "SECURITY RISK ANALYSIS FOR COMPLEX SYSTEMS Complex systems such as many Critical Infrastructures require new approaches in Risk Assessment and Management. In a complex system the emergent nature of much of its behaviour renders it difficult to enumerate the potential impacts of a range of scenarios. For Risk Assessment and Management a link must be made between the potential threat events and their final consequence. Given the complexity, interconnectivity, interdependency and potential geographical distribution of systems a simulation based approach offers a solution by allowing for consideration of the emergent behaviour of the system. It would, moreover, be desirable to combine an effective security documentation system with a simulation system to explore the range of system risk scenarios. This paper discusses the role of such a tool.",
    "13": "THE USE OF FILE TIMESTAMPS IN DIGITAL FORENSICS Digital evidence is not well perceived by the human senses. Crucial pieces of digital evidence may simply be missed by investigators as the forensic significance of seemingly unimportant pieces of collected data may not be fully understood. This paper will discuss how abstract pieces of information may be extracted from seemingly insignificant evidence sources such a file timestamps by making use of correlating evidence sources. The use of file timestamps as a substitute for missing or corrupt log files as well as the information deficiency problem surrounding the use of timestamps will be discussed in detail. A prototype was developed to help investigators to determine the course of event as they occurred according to file timestamps. The prototype results that were obtained as well as prototype flaws will also be addressed.",
    
    "14": "A MODEL FOR SECURE VALUE-ADDED SERVICE SUBSCRIPTIONS IN CELLULAR NETWORKS The current trends in South African cellular Value-Added Services are a melting-pot of consumer dissatisfaction. Only recently have regulations begun ensuring consumer protection. However recent experiences with subscription-based Value-Added Services have shown that the stricter regulations do not protect the consumer in a timely manner. The authors review Value-Added Services and the problems therewith and then go on to examine recent regulations dealing with these issues. The authors propose a procedural solution, which addresses the lack of compliance with the regulations regarding subscription-based Value-Added Services, to ensure customer protection. The proposed solution intends to implement customer authorization prior to a successful service transaction and in so doing avoid many of the existing problems with subscription-based Value-Added Service",
    "15": "MONTHLY PATCH RELEASE SCHEDULES: DO THE BENEFITS OUTWEIGH THE RISKS? This paper provides a comprehensive discussion on patch schedules. This discussion occurs over two parts. The first analyses existing implementations of patch schedules with a focus on Microsoft’s monthly patch schedule. The arguments for patch schedules, namely increased patch quality and better planning within organisations are analysed and the impact of the type of disclosure investigated. It is concluded that in the case of delayed disclosure, where the vulnerability researcher privately discloses the vulnerability to the vendor allowing a patch to accompany the public disclosure, patch schedules provide significant benefits. However, in the case of instantaneous disclosure, where a vulnerability is disclosed directly to the public, as in the case of 0days, implementing a patch schedule significantly increases the risk to organisations waiting for a vendor patch. Some vendors already allow for ’out of band’ patches to be released, however the criteria for choosing when to release a patch ’out of band’ in unclear and often subjective. Additionally, involving the community in rapidly prototyping and testing patches will provide intrinsic benefits. The second part then builds on these findings to provide advice to vendors implementing patch schedules. First the type of disclosure is recommended as an objective and pertinent criteria for differentiating when a patch should be released per a schedule or as soon as possible. Next, effective mechanisms for implementing both types of patch release are discussed. The paper concludes that while patch schedules can provide significant benefits, vendors can still make many improvements based on recent examples to significantly improve their patch release methodology.",
    "16": "THE NEED FOR CENTRALISED, CROSS PLATFORM INFORMATION AGGREGATION With the move towards global and multi-national companies, information technology infrastructure requirements are increasing. As the size of these computer networks increases, it becomes more and more difficult to monitor, control, and secure them. Network security involves the creation of large amounts of information in the form of logs and messages from a number of diverse devices, sensors, and gateways which are often spread over large geographical areas. This makes the monitoring and control difficult, and hence poses security problems. The aggregation of information is necessary in information audits, intrusion detection, network monitoring and management. The use of different platforms and devices complicates the problem, and makes aggregation more difficult. Network security administrators and security researchers require aggregation to simplify the analysis and comprehension of activity across the entire network. Centralised information aggregation will help deal with redundancy, analysis, monitoring and control. This aids the detection of wide spread attacks on global organisational networks, improving intrusion detection and mitigation. This paper discusses and motivates the need for centralised, cross platform information aggregation in greater detail. It also suggests methods which may be used, discusses the security issues, and gives the advantages and disadvantages of aggregation.",
    "17": "PERFORMANCE ANALYSIS OF A SECURE SEAMLESS HANDOVER MECHANISM IN ALL-IP NETWORKS Beyond third generation or B3G is the next generation of mobile networks that will comprise a heterogeneity of radio access technologies with a common IP core. Support for terminal mobility and thus handover is a key feature of these networks. Handover occurs when a terminal changes its point of attachment from one access router to another. Communication is not possible during the change in point of attachment. To ensure service continuity it is necessary to keep this interruption as short as possible. This paper quantitatively evaluates the performance of a secure proxy mobility protocol (ProMPt) that supports fast mobility between heterogeneous access networks in one operator’s domain. ProMPt is designed by integrating access security and mobility support for optimal performance instead of layering protocols for these two purposes. To enable quantitative evaluation, a test bed was setup with realistic wireless link emulation and an implementation of a basic ProMPt state machine. Results show that ProMPt outperforms Mobile IPv6 combined with EAP-AKA by one order of magnitude thus providing better service when a terminal moves between different access routers.",
    "18": "INTEGRATING SECURE RTP INTO THE OPEN SOURCE VOIP PBX ASTERISK Implementations of Voice over Internet Protocol (VoIP) have focused, up to now, mainly on the need to transport data in real-time, often at the expense of security. The neglect of secure VoIP is often intentional, as developers are striving to minimise overheads and delays. The Secure Real-Time Protocol (SRTP) has the potential to secure real-time streams without exacting too high a performance price. SRTP is the addition of security to the audio/video profile used in the Real-Time Transport Protocol (RTP). SRTP adds confidentiality, integrity and optionaly authenticity to RTP media streams. This paper focuses on the integration of SRTP into Asterisk, an open-source VoIP PBX. SRTP support has recently been added to Asterisk by Mikael Magnusson. This paper analyses Magnusson’s implementation, contrasting it to a proof-of-concept implementation developed independently at Rhodes University. The interoperability of SRTP implementations cannot be taken for granted, given the relatively recent standardization of the protocol, and so Magnusson’s implementation is tested against another SRTP implementation. Finally, the paper highlights a major shortcoming in Magnusson’s implementation, namely that the exchange of encryption keys is done in the clear. It concludes by proposing possible solutions, such as TLS, IPSec and MIkey",
    "19": "A LOW BIT ARCHITECTURE FOR A VERY COMPACT HARDWARE IMPLEMENTATION OF THE AES ALGORITHM This paper presents the implementation of the Advanced Encryption Standard algorithm on an 8-bit compact architecture. Encryption, key scheduling and decryption are implemented by small resources and extensive resource sharing. The architecture is perfectly suited for low cost applications which require moderately high data rates. Among the various cost effective and compact implementations already available, this architecture presents a novel design of the data path which has been modelled on 8-bit systolic architecture. The S-Box required for byte substitution has been implemented in BRAMS further reducing the consumed area. The design has been further embellished by a memory based controller which simplifies the control process and makes it viable for very effective hardware utilization. This produces one of the smallest implementations of the algorithm on FPGA with a reasonably high throughput. Considering the aforementioned, it minimizes area and power consumption, the basic factors of a low cost implementation. Comparisons drawn from FPGA implementation with other architectures have also been presented.",
    "20": "TOWARDS REGULATORY COMPLIANCE A MODEL FOR THE SOUTH AFRICAN FINANCIAL SECTOR The information age brought along with it, significant advances, challenges and changes, thus resulting in the businesses becoming more complex - significant advances such as using the cyber world as a market place, with the aid of new technology. Clearly, the trend of exploiting the cyber market has benefited the financial industry. However, whereas Information Technology is of critical importance to business, it also creates vulnerabilities which can be exploited. Many of these security issues are regulated by law. In particular, the SA financial sector is regulated (locally) by the Banks Act, Electronic Communication and Transaction Act (ECT Act) and the Financial Intelligence Center Act (FICA), to name a few. International legislation may also affect local banks, if they have international operations, for example the Gramm-Leach-Bliley Financial Services Modernization Act (GLBA), the Sarbanes-Oxley Act (SOX) and the Basel II Accord. Undoubtedly, the above-mentioned laws are crucial to ensure inter alia, that the security and privacy of information held by banks are protected. However, the adoption of more and more regulations is drawing heavily on resources from banks that have to ensure compliance with all the relevant laws. Attempts towards compliance might be disjointed and even contradictory if a unified approach is not followed. Various compliance projects initiated by a bank, could also duplicate controls that have already been put in place as part of other projects. Therefore we propose the South African Financial Regulatory (SAFReg) compliance model, a model to facilitate regulatory compliance in the SA financial sector. A generic model is proposed, but elements from the abovementioned laws that address security and privacy, are used as a case study or proof-of-concept.",
    "21": "A PROFILE OF THE DISTANCE COMPUTING STUDENT SOFTLIFTER The use of software in violation of applicable licensing agreements and copyright laws are reaching endemic proportions. One population cluster strongly linked to illegal software acts is the university student. While some research is available on patterns of illegal software use for non-monetary gain (softlifting) under residential student populations, a dearth of information exists on student populations at distance institutions. On face value, a distance institution offers a unique environment in which to study factors known to contribute to student softlifting behaviour under residential student populations. For example, whereas residential students offer the cost of software and their lack of income as one reason they softlift, the distance student is more likely to work full-time and study part-time, thereby earning an income. Moreover, whereas the younger residential student falls in age groups typically associated with softlifting activities, the distance student body is representative of all age groups and one would expect the older student to be less tolerant of softlifting. The distance student body is also drawn from across communities and cultures. Distance students also do no generally have contact with fellow students, an important source of softlifted applications. The distance computing student, in particular, is also likely to be employed in a computer-related field and is therefore expected to be more computer experienced than other students, anotheroft important factor strongly associated with softlifting. From a literature survey, several parameters thought to contribute towards the establishment of a profile of the distance computing student softlifter (DCSS) were identified and grouped into four categories, namely demography, motivation for use, sources and usage patterns. A base population of computing students was requested to complete an on-line questionnaire, and 226 students responded. The current study is an attempt to validate the identified parameters as profile predictors of the DCSS, and to present a profile of the DCSS.",
    "22": "THE ORGANISATIONAL INFORMATION SECURITY PROFILE A TOOL TO ASSIST THE BOARD What does the senior management of an organisation do when the board of directors asks, “show us that the organisation’s information security policy is implemented and maintained properly”? Such a question is likely to be asked as part of the board’s effort to show that it has met its obligations in terms of due diligence. This paper introduces a framework to facilitate the governing of information security in an organisation. The framework defines the concept of an organisational information security profile (OISP), the role of which is to retain and measure the level of efficiency of information security and inform the board accordingly. The paper discusses the OISP and each of its major building blocks. Each building block and its role are explained in detail. Ultimately the OISP will show how the information security of an organisation has been implemented based on the information security policy of the organisation and the changes that have taken place over time, therefore pointing out areas that need immediate attention.",
    "23": "On bidder zones, cell phones and ballot stuffing Ballot stuffing is the process of illegitimately creating a good reputation and requires a number of colluding fraudsters. With the use of an anonymising network, a single user could pose as many separate users and possibly implement the ballot stuffing scheme without the complexities of managing multiple fraudsters. In this paper we propose a framework that deals with thwarting ballot stuffing within the context of anonymising networks. The framework proposed depends on the ability to look up a single user’s physical location with a fair degree of certainty. With this mechanism in place, the framework is able to compare the locations of all users involved in a transaction. If the coordinates are within close proximity to one another (this is unlikely in a global trading system) then the transaction is tagged accordingly. The framework proposed does not necessarily apply to only thwarting ballot stuffing schemes, we discuss the fundamental problem of using anonymising networks to commit ballot stuffing and analyse another scheme (ticket scalping) that may be thwarted with this framework"
  }
}