{
  "title": {
    "0": "NO AGE DISCRIMINATION FOR BIOMETRICS",
    "1": "A NOVEL SECURITY METRICS TAXONOMY FOR R&D ORGANISATIONS",
    "2": "THE INFORMATION SECURITY OF A BLUETOOTH-ENABLED HANDHELD DEVICE",
    "3": "TOWARDS A FRAMEWORK FOR A NETWORK WARFARE CAPABILITY",
    "4": "A USER CENTRIC MODEL FOR ONLINE IDENTITY AND ACCESS MANAGEMENT ",
    "5": "COMPUTER MONITORING IN THE 21ST CENTURY WORKPLACE",
    "6": "SOCIAL ASPECTS OF INFORMATION SECURITY",
    "7": "AN INTRODUCTION TO STANDARDS RELATED TO INFORMATION SECURITY",
    "8": "UML MODELLING OF DIGITAL FORENSIC PROCESS MODELS (DFPMs)",
    "9": "PASSWORD MANAGEMENT: EMPIRICAL RESULTS FROM A RSA AND USA STUDY",
    "10": "COLLECTIVE IMPROVISATION: COMPLEMENTING INFORMATION SECURITY FRAMEWORKS WITH SELF-POLICING",
    "11": "BLOOM’S TAXONOMY FOR INFORMATION SECURITY EDUCATION",
    "12": "APPLICATION OF MESSAGE DIGESTS FOR THE VERIFICATION OF LOGICAL FORENSIC DATA",
    "13": "THE USE OF FILE TIMESTAMPS IN DIGITAL FORENSICS",
    "14": "A COLLABORATIVE DISTRIBUTED VIRTUAL PLATFORM FOR FORENSIC ANALYSIS OF MALICIOUS CODE",
    "15": "A PROOF-OF-CONCEPT IMPLEMENTATION OF EAP-TLS WITH TPM SUPPORT",
    "16": "SPAM CONSTRUCTION TRENDS",
    "17": "IMMUNE SYSTEM BASED INTRUSION DETECTION SYSTEM",
    "18": "THE IMPACT OF INFORMATION SECURITY AWARENESS TRAINING ON INFORMATION SECURITY BEHAVIOUR: THE CASE FOR FURTHER RESEARCH",
    "19": "THE PRINCIPLE OF SECURITY SAFEGUARDS: ACCIDENTAL ACTIVITIES",
    "20": "THE IP PROTECTION OF ELECTRONIC DATABASES: COPYRIGHT OR COPYWRONG?",
    "21": "SPAM OVER INTERNET TELEPHONY AND HOW TO DEAL WITH IT",
    "22": "LESSONS LEARNT IN THE PROCESS OF COMPUTERIZATION, AUTOMATION AND MANAGEMENT OF ICT SECURITY IN THE DEVELOPING WORLD: A CASE STUDY OF THE UNIVERSITY OF DAR ES SALAAM, TANZANIA",
    "23": "EMERGING FRAMEWORK FOR THE EVALUATION OF OPEN SOURCE SECURITY TOOLS"
  },
  "abstracts": {
    "0": "NO AGE DISCRIMINATION FOR BIOMETRICS Biometric advances apply to a range of disciplines to ensure the safety and security of individuals and groups. To stress the value of biometrics, this study focuses on the application of biometric techniques to a vast range of individuals and groups, irrespective of their age. This report covers biometric development within three generations. For the younger age group, biometrics can play a significant role in ensuring physical safety within the learning and dormitory environment. Additionally, biometrics can assist teachers within this environment to enhance the administration features. This allows more hands-on time for the education of children. The application of biometrics for adults has made great progression in the last couple of years. The research considers biometric advancements in the areas of travel and immigration, healthcare, law enforcement and banking. For the purpose of this study, adults are considered the individuals and groups in a working environment. Many of these applications are relevant to the younger and more senior generations as well. Senior citizens can also benefit from biometric applications. In many countries, biometric techniques control the administration of pension funds and general welfare administration. For each of the biometric applications, this research reviews the application of biometrics, associated advantages and disadvantages, as well as specific implementations. A number of sample applications from all overthe world, illustrates the usability of biometrics for a variety of groups, individuals and disciplines. From this report, it is clear that biometrics is a universal application, used by anyone, anywhere.",
    "1": "A NOVEL SECURITY METRICS TAXONOMY FOR R&D ORGANISATIONS In order to obtain evidence of the security and privacy issues of products, services or an organization, systematic approaches to measuring security are needed. In this study we survey the emerging security metrics approaches from the academic, governmental and industrial perspectives. We aim to bridge the gaps between business management, information security management and ICT product security practices. If appropriate security metrics can be to offer a quantitative and objective basis for security assurance, it would be easier to make business and engineering decisions concerning information security. We believe that being able to express a high-level taxonomy of security metrics will help the actual process of developing feasible composite metrics even for complex situations. A welldefined taxonomy can be used to enhance the composition of feasible security metrics all the way from business management to the lowest level of technical detail. Information security management, business management and, on the other hand, software security and network security engineering have been handled as separate areas. Common metrics approaches can be used to bridge the gaps in between.",
    "2": "THE INFORMATION SECURITY OF A BLUETOOTH-ENABLED HANDHELD DEVICE Bluetooth connectivity allows workers to access information anywhere, including both personal and corporate information. Software and applications have been specifically developed for handheld devices such as PDAs, giving users a high level of usability and functionality. The goal of this paper is to present an information security evaluation of a Bluetooth enabled handheld device, such as a PDA. The use of Bluetooth wireless technology and functionality provides added benefits, but also brings new information security threats to organisation’s information assets. The research attempts to understand the implications of using a Bluetooth enabled handheld device in both public and private environments. Five high-level layers are defined for this discussion. Security risks are evaluated based on current research into vulnerabilities, attacks and tools that exist tocompromise a Bluetooth enabled handheld device. Possible recommendations to mitigate identified security risks are also suggested.",
    "3": "TOWARDS A FRAMEWORK FOR A NETWORK WARFARE CAPABILITY Information warfare has surfaced as an emerging concept that affects not only military institutions but ordinary organisations as well. Information warfare in itself consists of various components ranging from its electronic and psychological aspects to its network enabled capabilities and functionality (network warfare). Various computer and information security practices form part of network warfare techniques. Whilst various information and security practices are well-known and applied by many, there is a need for a more structured approach to understanding the various techniques required for a network warfare capability. A conceptual framework describing the most important network warfare techniques and considerations is proposed. This paper addresses the requirements for a network warfare capability and will look at the high-level approach, constraints, focus areas, levels, techniques and objectives. The framework therefore intends to present a more conceptual and structural examination of network warfare requirements and techniques. It should therefore provide a good baseline when establishing the capability or determining the practical consequences in any sector.",
    "4": "A USER CENTRIC MODEL FOR ONLINE IDENTITY AND ACCESS MANAGEMENT The problem today is that users are expected to remember multiple user names and passwords for different domains when accessing the Internet. Identity management solutions seek to solve this problem by creating a digital identity that is exchangeable across organisational boundaries. This is done through the setup of collaboration agreements between multiple domains, thus users can easily switch across domains without having to repeatedly sign-on. However, this technology is accompanied by the threat of user identity and personal information being ‘stolen’. Criminals make use of fake or ‘spoofed’ websites as well as social engineering techniques to gain illegal access to a user’s information. This problem has been catapulted to the fore by the statement that phishing has increased by 8000% over the period January 2005 to September 2006 (APACS, 2007). Thus, the need for user protection from online threats has drastically increased. This paper examines two processes to protect user login information. Firstly, user’s information must be protected at the time of sign-on, and secondly, asimple method for the identification of the website is required by the user. This paper looks at these processes of identifying and verifying user information followed by how the user can verify the website at sign-on. The roles of identity and access management are defined within the context of single sign-on. Three different models for identity management are analysed, namely the Microsoft .NET Passport, Liberty Alliance Federated Identity for Single Sign-on and the Mozilla TrustBar for website authentication. A new model for the definitive protection of the user in the online environment is proposed based on the evaluation of these three existing models.",
    "5": "COMPUTER MONITORING IN THE 21ST CENTURY WORKPLACE This paper attempts to lay the foundation for future research into an area that has been called the “hottest workplace privacy topic of the next decade.” The existing empirical studies and the literature reviewed of this area suggest that the latest intrusive monitoring technologies which have been introduced to the current workplace has undoubtedly created an unwanted and unexpected imbalance and developed a wide gap in the 21st century employer/employee relationship. The paper argues for the introduction of Privacy enhancing technologies empowered with legal instruments in protection of workplace privacy. In addition, the paper is of the view that employees’ awareness and training on workplace privacy policy developments are decisive factors to achieve this objective and this in turn creates trust and confidence and beneficial to both employees and employers in the current workplace. The paper proposes a contractarian framework to protect employers’ interests and employees’ on-line rights. This paper suggests that employees’ views and opinions are more important in computer monitoring to develop a privacy policy in the workplace. To attain these objectives an empirical survey was conducted infive government sector organizations in Sri Lanka to gather factual information and to examine attitudes, beliefs and opinions on computer monitoring. The results of the study could be used as guide for policymakers and for legislatures involved in drafting privacy legislation, and associated policies relevant to the workplace",
    "6": "SOCIAL ASPECTS OF INFORMATION SECURITY Social Engineering (SE) threats have constituted a reality for Information Technology (IT) systems for many years. Yet, even the latest editions of the generally accepted Information Security (IS) standards and best practices directives do not effectively address the Social Engineering aspect of IS defences. SE attacks target the human element of IS by exploiting human relations to the maximum possible extent. The social relations between interacting individuals who are involved in an Information Security Management System (ISMS) structure, combined with the frequently unpredictable fashion that humans act and react to stimuli, provide opportunities that Social Engineers may and do exploit. In the ongoing effort against Social Engineering attacks, if the social elements of IS are ignored, fallacious working assumptions may be made. These inadvertently result in the creation of insufficient controls against identified SE threats. Hence, simply put, Information Security scientists can no longer afford to ignore the nature of the social structures that govern all aspects of human relations, and in particular those that lie within the context of an ISMS. This paper attempts to strengthen the pursued research on SE threat identification and control, by applying sociological principles to IT and ISMSs, thus bringing into the light their nature as social structures. This constitutes part of a larger effort by the authors to systematically identify and subsequently cater for SE threats to IS, in the context of which the social foundations of IS are examined.",
    "7": "AN INTRODUCTION TO STANDARDS RELATED TO INFORMATION SECURITY  The good thing about standards is that there are so many of them. This humorous comment is often made when some well meaning team member wants to solve a problem by referring to a standard. This may be true, but what is also true is that information systems are becoming more complex (in the vaguest sense of the word), that systems and the information processed are more distributed and that the requirement for access is more demanding. Also, the requirement for access is not limited to, or from, a specific or single site, organisation or even country. This has a huge effect on interfacing requirements, information storage and presentation formats and, of course, security. Adopting internationally recognised standards is a definite route to solve a lot of these problems. Standards are a mechanism for different stakeholders to refer to a common, trusted reference. Standards provide a common technological language, thus enabling a system stakeholder to provide definitions for terms used in a project, and to qualify vague expressions such as complex. The South African Bureau of Standards (SABS) is the recognised national institution for the promotion and maintenance of standards in South Africa. The SABS prepare and publish South African National Standards (identified by the letters SANS) reflecting national consensus on a wide range of subjects. A business unit of the SABS, Standards South Africa (StanSA), administers more than 450 technical committees and subcommittees to produce standards. The SABS is a member body of theInternational Organisation for Standardisation (ISO) and participates actively in a number of their committees. This tutorial provides a short introduction to International and South African National Standards related to Information Security. Some of the existing standards are highlighted and the development process is introduced. The tutorial focuses on ISO/IEC International Standards and the national adoption or development by StanSA",
    "8": "UML MODELLING OF DIGITAL FORENSIC PROCESS MODELS (DFPMs) A number of forensic processes have been used successfully in the field of Digital Forensics. The aim of this paper is to model some of these processes by using the Unified Modeling Language (UML) - specifically the behavioural Use Cases and Activity diagrams. This modelling gives a clear indication of the limitations of these processes. A UML-based comparison is made of two prominent DFPMs that are currently available in the literature. This is followed by a newly proposed DFPM as developed by the authors.",
    "9": "PASSWORD MANAGEMENT: EMPIRICAL RESULTS FROM A RSA AND USA STUDY “The state of information security as a whole is a disaster, a train wreck”. This view is given by Forte and Power (2007) describing the state of information security towards the end of the first decade of the 21st century. Amongst solutions offered, the view that security programs have to be holistic is proposed indicating that technical controls are of little value without the workforce understanding the risks of their irresponsible behavior. Another solution proposed by them is the role of awareness and education. All levels of users should be targeted letting them understand their role and responsibility in information security. Password related behavior is often highlighted as a key component of information securityawareness. However, studies have shown that password hygiene is generally poor amongst users (Stanton, Stam, Mastrangelo, & Jolton, 2005). In an effort to identify, categorize and prioritize those factors that may have a significant impact on password behavior, a study was conducted amongst students in South Africa and the United States of America to investigate certain aspects of password management practices. The objective of this paper is to report on the empirical results obtained, using techniques such as cause-and-effect diagrams and Pareto analyses.",
    "10": "COLLECTIVE IMPROVISATION: COMPLEMENTING INFORMATION SECURITY FRAMEWORKS WITH SELF-POLICING The approach to information security governance has predominantly followed a functionalist paradigm with emphasis placed on formalized rule structures and policy frameworks. The alternative socio-organisational (reflexive) approach has in the recent past grown in prominence due to the emergent socio-organizational aspect of technologies and processes. This paper challenges the epistemology of the functionalist approaches which assumes predictability. Information security practitioners realize that much of their activities are adapted to fit emergent changes. The aim of this paper is to explore an antidote to functionalist structured approaches by conceptualizing collective improvisation and self-policing. A case study approach that incorporates grounded theory techniques is employed for this purpose. Tentative findings reveal that collective improvisation is most pronounced in activities related to operational activities in governance. The implications of these and other findings are also discussed.",
    "11": "BLOOM’S TAXONOMY FOR INFORMATION SECURITY EDUCATION The importance of educating organizational end users about their roles and responsibilities towards information security is widely acknowledged. However, many current user education programs have been created by security professionals who do not necessarily have an educational background. The nature of such programs is thus not always properly understood. This lack of understanding could result in the ineffectiveness of security guidelines or programs in practice. This paper attempts to provide additional understanding of these programs through an examination of the revised version of Bloom’s taxonomy. The paper show how this taxonomy could be applied to information security education",
    "12": "APPLICATION OF MESSAGE DIGESTS FOR THE VERIFICATION OF LOGICAL FORENSIC DATA A message digest is a flxed length output produced by applying a cryptographic algorithm on input binary data of arbitrary length. If the input data changes even by one bit, the generated message digest will be completely difierent from the original. This is used in digital investigations to verify that stored digital evidence has not been tampered with. This technique has been applied successfully on physical disk images because there is only one continuous stream of data. However, this is not applicable to logical disk images where there is no obvious or standard method of concatenating the data to produce an output message digest. This paper describes the di–culties that complicate the computation of a message digest for logical data. In addition, a candidate process for calculating a veriflcation value for computer forensic evidence for logical data, regardless of its underlying representation is given. This method is presented in the context of cellphone forensics.",
    "13": "THE USE OF FILE TIMESTAMPS IN DIGITAL FORENSICS Digital evidence is not well perceived by the human senses. Crucial pieces of digital evidence may simply be missed by investigators as the forensic significance of seemingly unimportant pieces of collected data may not be fully understood. This paper will discuss how abstract pieces of information may be extracted from seemingly insignificant evidence sources such a file timestamps by making use of correlating evidence sources. The use of file timestamps as a substitute for missing or corrupt log files as well as the information deficiency problem surrounding the use of timestamps will be discussed in detail. A prototype was developed to help investigators to determine the course of event as they occurred according to file timestamps. The prototype results that were obtained as well as prototype flaws will also be addressed.",
    "14": "A COLLABORATIVE DISTRIBUTED VIRTUAL PLATFORM FOR FORENSIC ANALYSIS OF MALICIOUS CODE Malicious software is prevalent in many forms with the potential for many types of malware to be downloaded while browsing the Internet using an unprotected system. The potential impact can be irreparable harm to a computer file system or even place a person in a situation where they could be charged for a criminal act, if the perpetrator assumes control of their system. Understanding contemporary forms of malware is crucial in order to prepare better defences against it as well as investigate related incidents and claims. Therefore forensic analysis of specific malware, requires specialised tools and techniques and is of significant importance for information security professionals.In an effort to facilitate the process of forensic analysis of malicious and hostile code we intend to develop a system whereby specific malware can be identified, classified and the malware and detailed forensic analysis stored in a searchable database. The research results would assist computer forensics expert witnesses and infosecurity specialists, to determine the potential role, and impact on a case of certain malware types found to be present on a computer under examination. To this end, we first research on different types of malware and obtain a selection of malware samples as a specimen to investigate. We create an environment containing suitable investigative tools with which to analyse malware and devise a virtual testing utility platform (containing networking settings, software etc.) to conduct examinations. Experts can use the virtual infrastructure provided to analyse malware and then log their analysis results, notes and experiences in a bespoke on-line collaborative web accessed database. In there experts can log their findings and further produce analytical aids including the behavioural profile of the malware inspected, and potentially be others analysing the same types of malicious code.",
    "15": "A PROOF-OF-CONCEPT IMPLEMENTATION OF EAP-TLS WITH TPM SUPPORT Many people who have tried to configure their IEEE 802.11 enabled mobile phones to connect to a public wireless hotspot know one of the major differences between IEEE 802.11 networks and 2G: the missing standardized login process. While the 2G standard covers all aspects of the communication process, first IEEE 802.11 standards only targeted the data transmission. Due to this lack of standards for authentication, the login process and the missing secure subscriber identification, a number of different, mostly incompatible, login procedures have been established that are all far away from being as usable, comfortable and secure as 2G methods. This is why the authors of this paper propose to use EAP-TLS, which is a well established, secure and scalable authentication protocol, in combination with identities provided by a Trusted Platform Module (TPM) in order to archieve a high comfort for the user This paper describes the concept, presents a Linux based implementation, and evaluates the approach in a testbed",
    "16": "SPAM CONSTRUCTION TRENDS This paper replicates and extends Observed Trends in Spam Construction Techniques: A Case Study of Spam Evolution. A corpus of 169,274 spam email was collected over a period of five years. Each spam email was tested for construction techniques using SpamAssassin’s spamicity tests. The results of these tests were collected in a database. Formal definitions of Pu and Webb’s co-existence, extinction and complex trends were developed and applied to the results within the database. A comparison of the Spam Evolution Study and this paper’s results took place to determine the relevance of the trends. A geolocation analysis was conducted on the corpus, as an extension, to determine the major geographic sources of the corpus.",
    "17": "IMMUNE SYSTEM BASED INTRUSION DETECTION SYSTEM The threats and intrusions in IT systems can basically be compared to human diseases with the difference that the human body has an effective way to deal with them, what still need to be designed for IT systems. The human immune system (HIS) can detect and defend against yet unseen intruders, is distributed, adaptive and multilayered to name only a few of its features. Our immune system incorporates a powerful and diverse set of characteristics which are very interesting to use in the design of Intrusion Detection Systems (IDS). The authors propose therefore a hybrid intrusion detection system which combines host based and network based components but giving the focus to the host based intrusion detection as it is similar to the HIS. The proposed intrusion detection system will use the concepts of the artificial immune systems (AIS) which is a promising biologically inspired computing model based on the HIS. This paper presents an intrusion detection system based on the model of the human immune system and which will use the artificial immune systems paradigm. Furthermore the paper will also introduce some yet unused AIS concepts that can be applied to improve the effectiveness of IDS",
    "18": "THE IMPACT OF INFORMATION SECURITY AWARENESS TRAINING ON INFORMATION SECURITY BEHAVIOUR: THE CASE FOR FURTHER RESEARCH Information Security awareness initiatives are seen as critical to any information security programme. But, how do we determine the effectiveness of these awareness initiatives? We could get our employees to write a test afterwards to determine how well they understand the policies, but this does not show how it affects the employee’s on the job behaviour. Does awareness training have a direct influence on the security behaviour of individuals, and what is the direct benefit of awareness training? This paper represents a study in progress that aims to answer the question: to what extent does information security awareness training influence information security behaviour? Research carried out on information security has traditionally been slanted towards technical aspects of security, typically rooted in computer science and mathematics. Security was traditionally seen as a service to be provided and not something that was influenced by users. However, it was soon recognised that focusing on technical issues alone is inadequate. Technologies meant to provide security ultimately depend on the effective implementation and operation of these technologies by people. Thus awareness of policies is needed by all individuals in an organisation to ensure that policies are well understood and not misinterpreted. Someresearchers have maintained that educating users is futile mainly because it is believed that it is difficult to teach users complex security issues and secondly, because security is seen as secondary by the user they will not pay enough attention to it. This paper reflects research in progress and discusses some of the problems with existing information security awareness research and proposes a model to be tested for examining the impact of information security awareness training on information security behaviour",
    "19": "THE PRINCIPLE OF SECURITY SAFEGUARDS: ACCIDENTAL ACTIVITIES The principle of information security safeguards is a key information principle contained in every privacy legislation measure, framework, and guideline. This principle requires data controllers to use an adequate level of safeguards before processing personal information. However, privacy literature neither explains what this adequate level is nor how to achieve it. Hence, a knowledge gap has been created between privacy advocates and data controllers. This paper takes a step to bridge the aforementioned knowledge gap by presenting an analysis of how data protection and privacy commissioners have evaluated the level of adequacy of security protection given to personal information in selected privacy invasive cases. This study addresses security measures used to protect personal information against accidental incidents. This analysis also lays a foundation for building a set of guidelines for data controllers on designing, implementing, and operating both technological and organizational measures used to protect personal information",
    "20": "THE IP PROTECTION OF ELECTRONIC DATABASES: COPYRIGHT OR COPYWRONG? The protection of the intellectual investments embodied in databases is of the utmost importance. Technological innovation has rendered databases vulnerable to unauthorised access, reproduction, adaptation and publication. The copyright protection of databases is not always adequate to address the protection of non-original databases. Vast collections of data are thus vulnerable to information security threats. The European Union enacted a sui generis form of protection for non-original databases. A decade later a review of the first court decisions reveal paltry databases protection. The sui generis layer of IP protection in the EU has thus not led to innovation and growth in the European database industry. Courts' restrictions on the protection of single-source databases and the interpretation of the substantial investment requirement have contributed to the low level of database right adoption. The action of database owners against deep linking has proved to be much more effective than the database right. South Africa, as developing country, should devise its own strategies to cope with the proliferation of protectionism within the context of the widening digital divide. The database right seems to be copy wrong for now",
    "21": "SPAM OVER INTERNET TELEPHONY AND HOW TO DEAL WITH IT In our modern society telephony has developed to an omnipresent service. People are available at anytime and anywhere. Furthermore the Internet has emerged to an important communication medium. These facts and the raising availability of broadband internet access has led to the fusion of these two services. Voice over IP or short VoIP is the keyword, that describes this combination. The advantages of VoIP in comparison to classic telephony are location independence, simplification of transport networks, ability to establish multimedia communications and the low costs. Nevertheless one can easily see, that combining two technologies, always brings up new challenges and problems that have to be solved. It is undeniable that one of the most annoying facet of the Internet nowadays is email spam. According to different sources email spam is considered to be 80 to 90 percent of the email traffic produced. Security experts suspect that this will spread out on VoIP too. The threat of so called voice spam or Spam over Internet Telephony (SPIT) is even more fatal than the threat that arose with email spam, for the annoyance and disturbance factor is much higher. As instance an email that hits the inbox at 4 p.m. is useless but will not disturb the user much. In contrast a ringing phone at 4 p.m. will lead to a much higher disturbance. From the providers point of view both email spam and voice spam produce unwanted traffic and loss of trust of customers into the service.In order to mitigate this threat different approaches from different parties have been developed. This paper focuses on state of the art anti voice spam solutions, analyses them and reveals their weak points. In the end a SPIT producing benchmark tool will be introduced, that attacks the presented anti voice spam solutions. With this tool it is possible for an administrator of a VoIP network to test how vulnerable his system is",
    "22": "LESSONS LEARNT IN THE PROCESS OF COMPUTERIZATION, AUTOMATION AND MANAGEMENT OF ICT SECURITY IN THE DEVELOPING WORLD: A CASE STUDY OF THE UNIVERSITY OF DAR ES SALAAM, TANZANIA This paper intends to discuss and sift out current and important challenges in Information and Communication Technology (ICT) security for developing countries in the Sub-Saharan Africa where Tanzania will be taken as a case study. As a background we analyze lessons learnt in the processes of computerization, automation and the management of ICT security at the University of Dar es Salaam (UDSM) since it is one of the first higher learning institutions in Tanzania. The backbone of UDSM currently connects more than three thousand workstations and twenty five heavy duty servers that are centrally managed and which support different institutional core services. In the evolution process of computerization and automation of Information and Communication Technology (ICT) at the UDSM that started way back in the early 1990’s ICT security was of no priority. While in the western world computerization and automation processes have gradually been incorporating security into ICT infrastructures, developing countries have not experienced a similar evolution – neither in technical nor in practical circumstances. In practice, developing countries need to conform to international developments within ICT security at the same time as they are trying to conform to their own environments and also learn aboutthe totally new situation created. Simultaneously there are also local and specific restrictions – well known by the developing countries -but usually not experienced by the developed world.",
    "23": "EMERGING FRAMEWORK FOR THE EVALUATION OF OPEN SOURCE SECURITY TOOLS The drive from the South African Government towards the adoption of open source software across all platforms, incurred a number of research and development questions. The open source domain provides especially SMME’s with options to implement high quality software that are financially viable. Although software costs is a major factor within providing proper working environments, specific security issues pertaining to open source needs to be addressed. With the opening of networks as well as the availability of information, companies need not only implement security policies, but also constantly upgrade implementations. The study of open source security issues as well as the actual evaluation of tools therefore becomes essential. The purpose of this paper is to study the security issues within the open source environment and looking specifically at the use of security software originating from the open source domain. We provide details and results of surveys conducted around the adoption of security tools within SouthAfrican companies. The study leads to us proposing a emerging framework for the evaluation of open source security tools"
  }
}