{
  "title": {
    "0": "A BEST PRACTICE APPROACH TO LIVE FORENSIC ACQUISITION",
    "1": "TOO MANY LAWS BUT VERY LITTLE PROGRESS! IS SOUTH AFRICAN HIGHLY ACCLAIMED INFORMATION SECURITY LEGISLATION REDUNDANT?",
    "2": "EVALUATING INFORMATION SECURITY CONTROLS APPLIED BY SERVICE-ORIENTED ARCHITECTURE GOVERNANCE FRAMEWORKS",
    "3": "PHISHING: HOW AN ORGANISATION CAN PROTECT ITSELF",
    "4": "INTEGRATING INFORMATION ASSURANCE INTO SYSTEM ADMINISTRATION",
    "5": "AN ANALYSIS OF AUTHENTICATION FOR PASSIVE RFID TAGS",
    "6": "AUTOMATED FIREWALL RULE SET GENERATION THROUGH PASSIVE TRAFFIC INSPECTION",
    "7": "INVESTIGATING THE EFFECT OF GENETIC ALGORITHMS ON FILTER OPTIMISATION WITHIN FAST PACKET CLASSIFIERS.",
    "8": "E-MAIL SECURITY AWARENESS AT NELSON MANDELA METROPOLITAN UNIVERSITY (REGISTRAR’S DIVISION)",
    "9": "AN INTRODUCTION TO EMERGING THREATS AND VULNERABILITIES TO CREATE USER AWARENESS",
    "10": "A FRAMEWORK FOR THE RAPID DEVELOPMENT OF ANOMALY DETECTION ALGORITHMS IN NETWORK INTRUSION DETECTION SYSTEMS",
    "11": "HIGH-LEVEL INTEGRATED VIEW OF DIGITAL FORENSICS",
    "12": "ENHANCED PRESENCE HANDLING",
    "13": "DISCUSSING E-GOVERNMENT MATURITY MODELS FOR DEVELOPING WORLD – SECURITY VIEW",
    "14": "IDENTIFICATION OF BASIC MEASURABLE SECURITY COMPONENTS IN SOFTWARE INTENSIVE SYSTEMS",
    "15": "A FRAMEWORK FOR WEB SERVICES SECURITY POLICY NEGOTIATION",
    "16": "AN EXAMINATION OF THE GENERIC MEMORY CORRUPTION EXPLOIT PREVENTION MECHANISMS ON APPLE'S LEOPARD OPERATING SYSTEM",
    "17": "INDUCTIVELY DERIVING AN ORGANISATIONAL INFORMATION SECURITY RISK MANAGEMENT AGENDA BY EXPLORING PROCESS IMPROVISATION",
    "18": "INVESTIGATING IDENTITY CONCEALING AND EMAIL TRACING TECHNIQUES",
    "19": "HOW APPROPRIATE IS K-ANONYMITY FOR ADDRESSING THE CONFLICT BETWEEN PRIVACY AND INFORMATION UTILITY IN MICRODATA ANONYMISATION",
    "20": "THE DESIGN OF A WIRELESS FORENSIC READINESS MODEL (WFRM)",
    "21": "HELP US! WE WANT TO BE ‘E-SECURED’: DIGITAL BANKING CUSTOMERS’ SECURITY NEEDS IN SOUTH AFRICA",
    "22": "A SURVEY OF COMPUTER CRIME AND SECURITY IN SOUTH AFRICA",
    "23": "BC3I – TOWARDS REQUIREMENTS SPECIFICATION FOR PREPARING AN INFORMATION SECURITY BUDGET"
  },
  "abstracts": {
    "0": "A BEST PRACTICE APPROACH TO LIVE FORENSIC ACQUISITION The development of the Live Forensic discipline instigates the development of a method that allows forensically sound acquisition to stand fast in a court of law. The study presents the development of a comprehensive model for forensically sound Live Forensic Acquisition, the Liforac model. The Liforac model presents a number of concepts that are already available within the Cyber Forensics discipline, combined as a single document. It composes four distinct dimensions: Laws and regulations, Timeline, Knowledge and Scope. These dimensions combine to present a wide ranging model to guide First Responders and forensic investigators in acquiring forensically sound digital evidence. The dimensions were identified as part of an intense research study on the current application of Live Forensics and the associated problems and suggested controls. The Liforac model is an inclusive model that presents all aspects related to Live Forensic Acquisition, suggesting ways in which a Live Forensic Acquisition should take place to ensure forensic soundness. At the time of writing, this Liforac model is the first document of this nature that could be found for analysis. It serves as a foundation for future models that can refine the current processes.",
    "1": "TOO MANY LAWS BUT VERY LITTLE PROGRESS! IS SOUTH AFRICAN HIGHLY ACCLAIMED INFORMATION SECURITY LEGISLATION REDUNDANT? South Africa has myriad laws that address information security related issues. One such law is the Electronic Communications and Transactions Act of 2002 (ECTA), which is highly regarded internationally. A study, which forms the basis of this paper, found that not all provisions of this legislation that deal with information security are implemented by both the government and information security practitioners in corporate South Africa. The study found that the South African government has a relaxed approach to implementing some of the legal provisions regarding information security. The ECT Act agitates for the appointment of cyber inspectors who have powers to inspect, search and seize. A magistrate or a judge may issue a warrant requested by the cyber inspector. Although the legislation had good intentions, the government has not yet appointed the cyber inspectors. Although the ECT Act was in part intended to curb the spam emails, the effect of the Act is practically very little. The study also found that some of the information security laws are ambiguous, for example, the Patent Act. Some of the laws pertaining to information security are very old; they were in effect introducedbefore the Internet was used for commercial purposes. These include the Merchandise Marks Act of 1941 and Copyright Act of 1978. The findings of this study reflect that information security practitioners were not really familiar with the avalanche of information security related legislation. Be that as it may, the contents of the IT policies from some of the organisations that participated in this study contain the provisions of legislation were catered for in the policies. This should be attributed to the fact that although information security practitioners were not consciously trying to comply with legislation, they relied heavily on the international standards. Most of these standards are in line with the requirements of the South African information security related legislation. In other words, corporate information security policies are within the framework of the Constitution of the Republic and the applicable legislation by default. They are not consistent with constitutional and legislative provisions by conscious effort on the part of the information security practitioners. It is in this premise that this study contains a concept model for legal compliance for information security at the corporate environment. This model embodies the contribution of the study",
    "2": "EVALUATING INFORMATION SECURITY CONTROLS APPLIED BY SERVICE-ORIENTED ARCHITECTURE GOVERNANCE FRAMEWORKS Ensuring a secure Service-Oriented Architecture implementation within an organisation is challenging. Without sound information security principles supporting a Service-Oriented Architecture implementation, the rate of success is low. The information security principles of identification, authentication, authorization, confidentiality, integrity, availability and accountability remain the same for Service-Oriented Architectures. However, the Service-Oriented Architecture environment consists of agile implementations, which are designed around principles that demand a different approach that can be to the detriment of information security. Unless all information security issues related specifically to Service-Oriented Architecture are taken into consideration, an organisation faces unnecessary risks. An organisation faced with these added challenges may choose to avoid confronting this architectural approach altogether. Regrettably, an organisation could also miss out on the advantages and potential value that a Service-Oriented Architecture has to offer. In order to identify information security shortcomings regarding Service-Oriented Architecture governance frameworks, this paper evaluates two existing Service-Oriented Architecture governance frameworks against ISO/IEC 17799 (2005) controls. The paper presents an analysis and evaluation regarding the state of governance of information security for Service-Oriented Architectures, to assist managers on how this complex issue should be approached.",
    "3": "PHISHING: HOW AN ORGANISATION CAN PROTECT ITSELF The objective of this paper is to report on research to construct a model, which should provide guidance to an organization on how to address all dimensions associated with phishing and assist in solving the problem holistically. The emphasis will be placed on the human and organizational dimensions. Most research in this area has shown that only certain dimensions used to combat phishing attacks, in an organization, are addressed in isolation and not holistically. Anti-phishing research literature studied has either focused on algorithms for detecting phishing attacks in web browsers (Egelman, 2008; Fette, 2007; Garera, 2007; Patel, 2007) or on evaluating the user interfaces of anti-phishing web browser toolbars (Wu, 2006). From research studied, there has been little work conducted on preventing users from falling for phishing email messages. It has been proven that phishing does indeed pose an ongoing threat to an organization through its employees. Therefore, a suitable solution to this problem should be devised. This paper attempts to present such a holistic solution in the form of a model.",
    "4": "INTEGRATING INFORMATION ASSURANCE INTO SYSTEM ADMINISTRATION While the cost and flexibility benefits resulting from distributed and cloud computing environments are clearly evident, this approach also has farreaching implications for the threat surface presented as well as general information security risks, particularly to availability. The design of cloud-based storage services also implies that data once stored with such services may very hard to recall. The ease with which these services can be used implies that system administrators may not only be called upon much more frequently to make decisions that would previously have been the prerogative of system architects, but that such decisions may be based more on momentary expediency than sound architecture unless the implications are understood clearly. As the impact is both technical and legal in nature and can easily have a temporal extent well exceeding the life-time of a given configuration, we argue that the professional education of system and network administrators must take these security aspects into consideration even at the undergraduate level. We therefore outline a curriculum integrating information security and security management topics into a 3-year (180 credit points in the European Credit Transfer System) Bachelor of Science degree in Computer Sciencewith specializations in either Network and System Administration Operations or Information Security intended to enable students to create, operate, and maintain information systems not only fulfilling functional, efficiency, and robustness requirements, but also minimizing information security and liability risks.",
    "5": "AN ANALYSIS OF AUTHENTICATION FOR PASSIVE RFID TAGS RFID (Radio Frequency Identification) tags have become pervasive for identifying objects, people and pets, automated payment and theftdeterrents. However, assurance of tag identity has not been built into the RFID environment. Privacy by means of encryption can prevent the data from being human readable but cannot stop a clone being created. This paper considers recent approaches that have been proposed to breach this gap. These include PUF’s (Physically Unclonable Functions), cryptography, digital signatures and radio fingerprints. This paper contributes a critical analysis of current approaches in order to identify requirements for RFID tag authentication, focusing on passive RFID tags used for product authentication",
    "6": "AUTOMATED FIREWALL RULE SET GENERATION THROUGH PASSIVE TRAFFIC INSPECTION Introducing firewalls and other choke point controls in existing networks is often problematic, because in the majority of cases there is already production trafic in place that cannot be interrupted. This often necessitates the time consuming manual analysis of network trafic in order to ensure that when a new system is installed, there is no disruption to legitimate fiows. To improve upon this situation it is proposed that a system facilitating network trafic analysis and firewall rule set generation is developed. A high level overview of the implementation of the components of such a system is presented. The system makes use of a third party package, named Firewall Builder which provides firewall rule sets for a wide variety of firewalling solutions. Additions to the system are scoring metrics which may assist the administrator to optimise the rule sets for the most eficient matching of flows, based on trafic volume, frequency or packet count.",
    "7": "INVESTIGATING THE EFFECT OF GENETIC ALGORITHMS ON FILTER OPTIMISATION WITHIN FAST PACKET CLASSIFIERS Packet demultiplexing and analysis is a core concern for network security, and has hence inspired numerous optimisation attempts since their conception in early packet demultiplexing fllters such as CSPF and BPF. These optimisations have generally, but not exclusively, focused on improving the speed of packet classiflcation. Despite these improvements however, packet fllters require further optimisation in order to be efiectively applied within next generation networks. One identifled optimisation is that of reducing the average path length of the global fllter by selecting an optimum fllter permutation. Since redundant code generation does not change the order of computation, the initial fllter order before fllter optimisation afiects the average path length of the resultant control-flow graph, thus selection of an optimum permutation of fllters could provide signiflcant performance improvements. Unfortunately, this problem is NP-Complete. In this paper, we consider using Genetic Algorithms to ’breed’ an optimum fllter permutation prior to redundant code elimination. Speciflcally, we aim to evaluate the efiectiveness of such an optimisation in reducing fllter control flow graphs.",
    "8": "E-MAIL SECURITY AWARENESS AT NELSON MANDELA METROPOLITAN UNIVERSITY (REGISTRAR’S DIVISION) Electronic mail (e-mail) has become a critical business tool within most modern organisations. The proper security features need to be in place to ensure confidentiality, integrity and availability of business related information. After the security features are in place, all staff members need to be educated in the proper use of these features and the proper use of confidential information (ISO SANS 17799, 2005). This paper presents a survey that was performed in the Registrar’s Division at the Nelson Mandela Metropolitan University (NMMU). Structured interview questions were compiled by the researcher. The interviews were conducted on a one-on-one basis with the interviewee. The findings were documented and recommendations were made to improve the usage of the e-mail system and the awareness of security issues amongst the staff at NMMU (Olivier, 2004)",
    "9": "AN INTRODUCTION TO EMERGING THREATS AND VULNERABILITIES TO CREATE USER AWARENESS With technological change and advancement, attackers are increasingly becoming more sophisticated in their attack strategies and techniques. Other global factors and developments also impact the line of attack. This paper provides an introduction to the most current, pertinent attack strategies and trends. It aims to create an awareness of emerging areas that should be better studied and understood. The paper addresses the blurring lines of cyber crime, information warfare and cyber terror to indicate the key concerns at a national, commercial, governmental and individual level. Thus, the paper proposes and discusses topical security threats to elucidate their methodology and gauge their impact such that further strategic, operational and technical measures can be taken",
    "10": "A FRAMEWORK FOR THE RAPID DEVELOPMENT OF ANOMALY DETECTION ALGORITHMS IN NETWORK INTRUSION DETECTION SYSTEMS Most current Network Intrusion Detection Systems (NIDS) perform detection by matching traffic to a set of known signatures. These systems have well defined mechanisms for the rapid creation and deployment of new signatures. However, despite their support for anomaly detection, this is usually limited and often requires a full recompilation of the system to deploy new algorithms. As a result, anomaly detection algorithms are time consuming, difficult and cumbersome to develop. This paper presents an alternative system which permits the deployment of anomaly detection algorithms without the need to even restart the NIDS. This system is, therefore, suitable for the rapid development of new algorithms, or in environments where high-availability is required.",
    "11": "HIGH-LEVEL INTEGRATED VIEW OF DIGITAL FORENSICS We are living in a world where there is an increasing need for evidence in organizations. Good digital evidence is becoming a business enabler. Very few organizations have the structures (management and infrastructure) in place to enable them to conduct cost effective, low-impact and efficient digital investigations (Sommer, 2005). Digital Forensics (DF) is a vehicle that organizations use to provide good and trustworthy evidence and processes. The current DF frameworks concentrate on reactive investigations, with limited reference to DF readiness and live investigations. However, organisations use DF for other purposes. The paper proposes that DF consists of three components: Proactive (ProDF), Active (ActDF) and Reactive (ReDF). ProDF concentrates on DF readiness and the proactive, responsible use of DF to demonstrate good governance and enhance governance structures. ActDF consider the gathering of live evidence during an ongoing attack with limited live investigation and ReDF deals with the traditional DF investigation. The paper discusses each component and the relationship between the components",
    "12": "ENHANCED PRESENCE HANDLING The global use of the Internet and modern mobile/cellular communications networks has made ubiquitous communications possible for millions of people worldwide. However, these technologies can interrupt our daily activities through uncontrolled, unwanted disturbances. Such negative efiects can be lessened by using context information and presence technology to inform others of our availability for communication. By nature context information can be sensitive and a commodity which its owner values highly. It thus becomes important to assess the impact of releasing such information on personal privacy. This can vary widely, depending on various factors. In this paper the authors review presence technology as a means to control unwanted disturbances. We consider the privacy implications and propose an enhanced presence processing model which leverages Role-Based Access Control (RBAC) principles as well as a new concept, Availability Profiles. We present the model incrementally over three progressive and logical stages.",
    "13": "DISCUSSING E-GOVERNMENT MATURITY MODELS FOR DEVELOPING WORLD – SECURITY VIEW The development of Information and Communication Technology (ICT) systems towards materialization into e-Government applications is expected to tremendously change the ways governments deliver their core business services to citizens and how citizens can interact with their governments. There are also high expectations that these changes will play major roles in the socio-economic developments. For these reasons there are several so called maturity models being developed to guide and benchmark e-government developments in developing countries. These models describe various stages, three to six, referring to technological complexity. However, we do not see explicitly that security is addressed as a specific issue at the various stages, nor do we see how cultural, legal, economical and managerial security related issues are incorporated. Being part of the ongoing research in the area, the paper attempts to critically investigate, evaluate and analyze eleven existing e-government maturity models, and discuss the findings in the light of research findings from four government institutions located in the Sub-Saharan Africa",
    "14": "IDENTIFICATION OF BASIC MEASURABLE SECURITY COMPONENTS IN SOFTWARE INTENSIVE SYSTEMS Appropriate information security solutions for software-intensive systems, together with evidence of their security performance help to prevent serious consequences for businesses and the stakeholders. Security metrics can be used to offer this evidence. We investigate practical and holistic development of security metrics for software-intensive systems. Our approach is security requirement-centric. The high-level security requirements are expressed in terms of lower-level measurable components applying a decomposition approach. Detailed security metrics are developed based on the basic measurable components identified at the leaf level of the decomposition.",
    "15": "A FRAMEWORK FOR WEB SERVICES SECURITY POLICY NEGOTIATION In today’s business environment, the use of web services technology is becoming more popular. This growth has been met with an increase of security related attacks, which has caused web services providers to adopt stricter security policies. As not all web service consumers can implement the security requirements of web services providers, they may turn to use the services of other providers. In order to address this problem, this paper introduces a framework for a web services security policy negotiation system that web services consumers and providers can use to negotiate a customised security contract. The framework is defined over current web services technology, to be used by business-to-business (B2B) web services collaborations. The inflexibility of current security policy specification languages for negotiation is overcome, by incorporating human intuitiveness supported by an intelligent negotiation support system.",
    "16": "AN EXAMINATION OF THE GENERIC MEMORY CORRUPTION EXPLOIT PREVENTION MECHANISMS ON APPLE'S LEOPARD OPERATING SYSTEM The Win32 platform has long been the whipping boy of memory corruption attacks and malware, which has forced Microsoft into implementing aggressive anti-exploitation mechanisms into their newer Operating Systems. Apple's Mac OS X (Leopard) has had a much smoother run, both in the media, and in terms of high profile attacks and the reason for this is less clear. In light of Apple's increased market-share, a comparison between Microsoft's defences and Apple's defences is required as the number of anti-exploitation techniques increases with time. In order to produce a side-by-side comparison, an overview of memory corruption attacks is provided and the common generic anti-exploitation techniques for these attacks are enumerated and described. For each operating system, the quality and effective of each implemented defence is evaluated. The results of the study show that Leopard trails Windows Vista in both the number of defences, as well as the quality and effectiveness of the defences that are implemented",
    "17": "INDUCTIVELY DERIVING AN ORGANISATIONAL INFORMATION SECURITY RISK MANAGEMENT AGENDA BY EXPLORING PROCESS IMPROVISATION In times of heightened uncertainty and unpredictability it is believed that incrementalist approaches that are not resolute to order and control in information security risk management (ISRM) are necessary. This is because information security incidents that occur in context are noted to differ one from another. Incrementalist approaches to ISRM apply when contextual security risk instances are rare, unique and complex. This paper qualitatively explores and draws viewpoints from information security management on the incrementalist viewpoint of managing information security risk. Attention is given to process improvisation, an explication of combined functionalism and incrementalism which places an emphasis on ways in which practitioners creatively mitigate information security risk. An in-depth case study approach has been used to explore this phenomenon and grounded theory techniques employed to analyse the data. The process of inductive theory building that serves as impetus for an ISRM agenda shows the fit between data and the emerging theory on process improvisation. Findings highlighted in this paper yield rich insights about how an ISRM agenda may incorporate incrementalist and functionalist approaches. Implications for such an agenda to practising information security professionals are also presented.",
    "18": "INVESTIGATING IDENTITY CONCEALING AND EMAIL TRACING TECHNIQUES At present it is very difficult to trace the identity of spammers who use identity concealment techniques. It is difficult to determine the identity of the spammer by just analysing the electronic trail. This paper will look at standard email tracing techniques and how email senders try and hide their electronic trail. The identity concealing techniques that that are discussed are: Spoofing, Bot-Networks, Open proxies, Open mail relays and untraceable Internet connections. The techniques used to trace spam that we discuss are: Header analysis and honeypot computers. The paper will also Investigate advanced digital forensics techniques for email tracing namely Investigating residual data on servers and investigating network devices",
    "19": "HOW APPROPRIATE IS K-ANONYMITY FOR ADDRESSING THE CONFLICT BETWEEN PRIVACY AND INFORMATION UTILITY IN MICRODATA ANONYMISATION Before statistical data, such as microdata, can be released to the public, it needs to be anonymised. Anonymisation protects the privacy of the individuals whose data is released. However, as microdata is anonymised, its level of privacy increases, while its level of information utility decreases. K-anonymity is often used to address the conflict between privacy and information utility in microdata anonymisation. In this paper, we determine the extent to which k-anonymity is appropriate for addressing this conflict. We argue that the way in which k-anonymity is currently used to address this conflict does not necessarily lead to an optimum balance between privacy and information utility. We also provide recommendations for an appropriate solution for addressing the conflict between privacy and information utility.",
    "20": "THE DESIGN OF A WIRELESS FORENSIC READINESS MODEL (WFRM) The proliferation of wireless mobile communication technology has emerged and this has resulted in the increase of the wireless users. On the other hand, cyber crime in WLANs has appeared to be gradually increasing world wide. Wireless network forensics is seen as not only a counterproposal but as a solution to the rapid increase of cyber crime in WLANs. However, the key issues impacting wireless network forensics are, firstly, it is an enormous challenge to monitor and collect all the communications generated by the communicating mobile devices and conduct a proper digital forensic investigation. Secondly, network traffic only exists for split seconds, and because of its large volume, it may be retained for a limited time before storage space is depleted. Therefore this suggests that WLANs are not forensically ready to gather enough evidence that can be used for subsequent forensic purposes. In an attempt to address this issue, this paper proposes a Wireless Forensic Readiness Model (WFRM) with the capabilities of monitoring, preserving and analysing wireless network traffic.",
    "21": "HELP US! WE WANT TO BE ‘E-SECURED’: DIGITAL BANKING CUSTOMERS’ SECURITY NEEDS IN SOUTH AFRICA In the context of this paper digital banking refers to online, mobile, and Automated Teller Machine (ATM) banking. Digital banking, particularly online and mobile banking, is growing rapidly in South Africa. This is happening despite heightened security concerns, created in part by the media. The 2008 World Wide Worx and Wits Business School Digital Banking Research found that the level of sophistication related to the electronic related crime in the banking sector is extraordinary. The aforesaid research revealed that most of the digital banking crime affect online banking and ATM. The media captured the crime phenomenon by using catchy headlines. The 2008 World Wide Worx and Wits Business School Digital Banking Research employed both qualitative research approaches. Quantitative data collection method was employed at an elementary level to capture relevant statistics. Purposive sampling was used to select the participating banks. Researchers deliberately targeted the biggest banks in South Africa - Standard Bank, ABSA, Nedbank, and Investec. Although the First National Bank did not participate in the 2008 study, researchers made deductions based on previous engagement with the bank. The research findings reflect various types of digital banking related crimes and some of the measures taken by the banks. Theseinclude SIM [Subscriber Identity Module] swop fraud, phishing, ATM bombings, card swapping, and card skimming. Seeing that customers are extremely concerned about the digital banking crime, the banks are reacting to the crime swiftly with a lot of sophistication. The phishing websites are removed and suspicious emails blocked. The spoof site can be knocked off the web within 48 hours whilst the fraudsters are tracked down speedily. With the assistance of the South African Police Services, banks have managed to bring down the frequency of the ATM bombings. Some of the methods employed by the banks to combat e-crime are very controversial. For example, some of the banks hire their own hackers and bomb their own ATMs. Banks also have dedicated e-crime units and invest huge financial resources on customer education. These initiatives are yielding good results. In the medium to long term, the success of countermeasures to crime in digital banking increases client confidence. Interestingly, this study found that some banking customers did not have fears regarding mobile banking as a delivery channel.",
    "22": "A SURVEY OF COMPUTER CRIME AND SECURITY IN SOUTH AFRICA ",
    "23": "BC3I – TOWARDS REQUIREMENTS SPECIFICATION FOR PREPARING AN INFORMATION SECURITY BUDGET The entire business landscape finds itself on the verge of a recession because of ongoing global economic turmoil. Thus, there is a heightened need to minimise and mitigate business risk and scrutinise information spending while ensuring compliance with regulatory mandates. This calls for decision makers to become vigilant in their spending and move towards an optimised information security investment. The main aim of this paper is to provide decision makers with a set of requirements to be considered when implementing a cost-effective and optimal information security budget; in a manner that preserve organisations’ information security posture and compliance status. Research reported on in this paper forms part of an ongoing project known as the BC3I (Broad Control Category Cost Indicators) framework."
  }
}