{
  "year2015": [
    {
      "title": "A formal qualitative risk management approach for IT security",
      "abstract": "Information technology (IT) security, which is concerned about protecting the confidentiality, integrity and availability of information technology assets, inherently possesses a significant amount of risk, some known and some unknown. IT security risk management has gained considerable attention over the past decade due to the collapsing of some large organisations in the world. Previous investigative research in the field of IT security have indicated that despite the efforts that organisations employ to reduce IT security risks, the trend of IT security attacks are still increasing. One of the contributing factors to poor management of IT security risk is attributed to the fact that IT security risk management is often left to the technical security technologist who do not necessarily employ formal risk management tools and reasoning. For this reason, organisations find themselves in a position where they do not have the correct approach to identify, assess and treat IT security risks. Employing a formal risk based approach in managing IT security risk assist in ensuring that risks that matter to an organisation are accounted for and as a result, receive the correct level of attention. Defining an approach of how IT security risk is managed should be seen as a fundamental task, which is the basis of this research. The objective of this paper is to propose an approach for identifying, assessing and treating IT security risk which incorporates a robust risk analysis and assessment process. The risk analysis process aims to make use of a comprehensive IT security risk universe which caters for the complex and dynamic nature of IT security. The research will contribute to the field of IT security by using a consolidated approach that utilises coherent characteristics of the available qualitative risk management frameworks to provide a stronger approach that will enable organisations to treat IT security risk better."
    },
    {
      "title": "A Framework of Opportunity-Reducing Techniques to Mitigate the Insider Threat-Towards Best Practice",
      "abstract": "This paper presents a unified framework derived from extant opportunity-reducing techniques employed to mitigate the insider threat leveraging best practices. Although both motive and opportunity are required to commit maleficence, this paper focuses on the concept of opportunity. Opportunity is more tangible than motive; hence, it is more pragmatic to reflect on opportunity-reducing measures. Situational Crime Prevention theory is the most evolved criminology theory with respect to opportunity-reducing techniques. Hence, this theory will be the basis of the theoretical framework. The derived framework highlights several areas of research and may assist organizations in implementing controls that are situationally appropriate to mitigate insider threat."
    },
    {
      "title": "A Model for the Design of Next Generation e-supply Chain Digital Forensic Readiness Tools",
      "abstract": "The internet has had a major impact on how information is shared within supply chains, and in commerce in general. This has resulted in the establishment of information systems such as e-supply chains amongst others which integrate the internet and other information and communications technology (ICT) with traditional business processes for the swift transmission of information between trading partners. Many organisations have reaped the benefits of adopting the eSC model, but have also faced the challenges with which it comes. One such major challenge is information security. Digital forensic readiness is a relatively new exciting field which can prepare and prevent incidents from occurring within an eSC environment if implemented strategically. With the current state of cybercrime, tool developers are challenged with the task of developing cutting edge digital forensic readiness tools that can keep up with the current technological advancements, such as (eSCs), in the business world. Therefore, the problem addressed in this paper is that there are no DFR tools that are designed to support eSCs specifically. There are some general-purpose monitoring tools that have forensic readiness functionality, but currently there are no tools specifically designed to serve the eSC environment. Therefore, this paper discusses the limitations of current digital forensic readiness tools for the eSC environment and an architectural design for next-generation eSC DFR systems is proposed, along with the system requirements that such systems must satisfy. It is the view of the authors that the conclusions drawn from this paper can spearhead the development of cutting-edge next-generation digital forensic readiness tools, and bring attention to some of the shortcomings of current tools."
    },
    {
      "title": "Access Control for Local Personal Smart Spaces",
      "abstract": "As computer systems grow more compact, powerful and cheap to produce, they become more pervasive in society. Smart devices enable users to compute and share resources on the go. Services such as Wi-Fi Direct allow for the creation of device-to-device networks, of a peer-to-peer nature, deemed \"smart spaces\". Smart spaces are capable of providing an accesspoint-less means to share information and resources between their peers. Recent research points to the personalisation of smart spaces, making their management more challenging. Personalised smart spaces,  advanced as they may be, introduce new security challenges such as secure resource sharing.  This paper consequently evaluates a family-related scenario  then a LPSS access control framework is proposed, with a focus on the specific nature of LPSS environments namely, local and global sets of rules defined in local and global policies. Finally, access control rules are presented, with respect to the motivating scenario, to illustrate the operation of access control enforcement using local and global policy rules."
    },
    {
      "title": "Adding Event Reconstruction to a Cloud Forensic Readiness Model",
      "abstract": "During post-event response, proactive forensics is of critical importance in any organisation when conducting digital forensic investigations in cloud environments. However, there exist no reliable event reconstruction processes in the cloud that can help in analysis and examination of Digital Evidence (DE) aspects, during Digital Forensic Readiness (DFR) process, as defined in the standard of ISO/IEC 27043:2015.  The problem that this paper addresses is the lack of an easy way of performing digital event reconstruction process when the cloud is forensically ready in preparation of a Digital Forensic Investigation (DFI). During DFR approaches, event reconstruction helps in examination and pre-analysis of the characteristics of potential security incidents. As a result, the authors have proposed an Enhanced Cloud Forensic Readiness (ECFR) process model with event reconstruction process that can support future investigative technologies with a degree of certainty. We also propose an algorithm that shows the methodology that is used to reconstruct events in the ECFR. The main focus of this work is to examine the addition of event reconstruction to the initially proposed Cloud Forensic Readiness (CFR) model, by providing a more enhanced and detailed cloud forensic readiness model."
    },
    {
      "title": "AFA-RFID- Physical Layer Authentication for Passive RFID Tags",
      "abstract": "Radio Frequency IDentification, or RFID, is a ubiquitous technology found across many industries, but which is susceptible to breaches of information security. This research introduces analogue fingerprints as a means to authenticate passive RFID tags. An authentication model implemented at the physical layer of a passive RFID tag, using analogue fingerprints is proposed. The use of analogue computing principles increases the amount of potential authentication data whilst reducing the potential for counterfeiting."
    },
    {
      "title": "An investigation into credit card information disclosure through Point of Sale purchases",
      "abstract": "The use of debit and credit cards has become indispensable to consumers worldwide. This cashless method of payment offers flexibility and convenience. It eliminates the safety risk of carrying large cash amounts in person and cards can be cancelled as soon as it is lost or stolen. One of the most popular methods of non-cash transactions is through a Point of Sale (POS) terminal. A POS is a quick and convenient method for a customer to pay a business, but may lead to the disclosure of sensitive information without the knowledge of the customer. By investigating the information printed on the customer and merchant transaction receipts at various POS devices in South Africa, it is shown that information provided on the POS transaction receipts can put the consumer at risk as the credit card number, expiry date and name of the card holder may be printed on these transaction receipts. This paper investigates various POS devices used by South African businesses and the relevant information printed on the merchant and customer transaction receipts after a transaction. It is shown that the information contained in the transaction receipts from certain POS terminals is sufficient to perform successful online purchases at multiple online shopping sites. We also show that when the CVV number on the back of the credit card can be obtained while the transaction is in progress, even more online shopping sites can be successfully used without the authorisation or knowledge of the credit card owner."
    },
    {
      "title": "Analyzing the Security Posture of South African Websites",
      "abstract": "Today, public-facing websites are virtually used across all different sectors by different types of organizations for information sharing and conducting core business activities. At the same time, the increasing use of mobile devices in Africa has also propelled the deployment and adoption of web-based applications. However, as the use of websites increases, so are the cyber-attacks. Web-based attacks are prevalent across the globe, and in South Africa an increase in such attacks is being observed. Research studies also suggest that over 80% of the active websites are vulnerable to a myriad of attacks. This paper reports on a study conducted to passively analyze and determine the security posture of over 70 South African websites from different sectors. The security posture of the local websites was thereafter compared against the top ten (10) global websites. The list of the websites was mainly chosen using the Amazon’s Alexa service. The focus of the study was mainly on the security defense mechanisms employed by the chosen websites. This approach was chosen because the client-side security policies, which may give an indication of the security posture of a website, can be analyzed without actively scanning multiple websites. Consequently, relevant web-based vulnerabilities and security countermeasures were selected for the analysis.  The results of the study suggest that most of the 70 South African websites analyzed are vulnerable to cross-site scripting, injection vulnerabilities, clickjacking and man-in-middle attacks. Over 67% of the analyzed websites unnecessarily expose server information, approximately 50% of the websites do not protect session cookies, about 30% of the websites use secure communications, in particular for transmitting users’ sensitive information, and some websites use deprecated security policies.  From the study, it was also determined that South African websites lag behind in adopting basic security defense mechanisms when compared against top global websites."
    },
    {
      "title": "Biometrical Identification- Are we ethically ready_",
      "abstract": "“Give us your fingerprint, your Iris print, your photograph. Trust us; we want to make your life easier!” This is the implicit message behind many corporations’ move towards avid collection and use of biometrics, and they expect us to accept their assurances at face value. Despite their attempts to sell this as a wholly philanthropic move, the reality is that it is often done primarily to ease their own processes or to increase profit. They offer no guarantees, allow no examination of their processes, and treat detractors with derision or sanction. The current biometric drive runs counter to emergent wisdom about the futility of a reductionist approach to humanity. Ameisen et al. (2007) point out that the field of integrative biology is moving towards a more holistic approach, while biometrics appear to be moving in the opposite direction, reducing humans to sets of data with cartographic locators: a naïve over-simplification of the uniqueness that characterizes humanity. They argue that biometrics treat the body as an object to be measured, but in fact the body is a subject, the instantiation of the individual’s self, subject to vulnerability and mortality. Treating it merely as a measured and recorded object denies the body’s essential right to dignity. Here we explore various concerning aspects of the global move towards widespread biometric use."
    },
    {
      "title": "Characterization and analysis of NTP amplification based DDoS attacks",
      "abstract": "Network Time Protocol based DDoS attacks saw a lot of popularity throughout 2014. This paper shows the characterization and analysis of two large datasets containing packets from NTP based DDoS attacks captured in South Africa. Using a series of Python based tools, the dataset is analysed according to specific parts of the packet headers. These include the source IP address and Time-to-live (TTL) values. The analysis found the top source addresses and looked at the TTL values observed for each address. These TTL values can be used to calculate the probable operating system or DDoS attack tool used by an attacker. We found that each TTL value seen for an address can indicate the number of hosts attacking the address or indicate minor routing changes. The Time-to-Live values, as a whole, are then analysed to find the total number used throughout each attack. The most frequent TTL values are then found and show that the migratory of them indicate the attackers are using an initial TTL of 255. This value can indicate the use of a certain DDoS tool that creates packets with that exact initial TTL. The TTL values are then put into groups that can show the number of IP addresses a group of hosts are targeting"
    },
    {
      "title": "Cloud Supply Chain Resilience- A Coordination Approach",
      "abstract": "Cloud computing is a service-based computing resources sourcing model that is changing the way in which companies deploy and operate information and communication technologies (ICT). This model introduces several advantages compared with traditional environments along with typical outsourcing benefits reshaping the ICT services supply chain by creating a more dynamic ICT environment plus a broader variety of service offerings. This leads to higher risk of disruption and brings additional challenges for organisational resilience, defined herein as the ability of organisations to survive and also to thrive when exposed to disruptive incidents. This paper draws on supply chain theory and supply chain resilience concepts in order to identify a set of coordination mechanisms that positively impact ICT operational resilience processes within cloud supply chains and packages them into a conceptual model."
    },
    {
      "title": "Data Aggregation Using Homomorphic Encryption in Wireless Sensor Networks",
      "abstract": "Secure information aggregation using homomorphic encryption in wireless sensor networks allows data to be aggregated without having to decrypt the packets. While data aggregation provides a means to reduce network traffic, homomorphic encryption increases the size of the packets and this could negatively affect system performance. This is because energy consumption of the nodes is directly proportional to the amount of data transferred. In this paper, the effect of this increased packet size was investigated for the Domingo-Ferrer encryption scheme and compared to a symmetric encryption scheme. It was found that the symmetric encryption scheme outperforms the homomorphic encryption scheme for smaller networks, but as the network size grows, homomorphic encryption starts outperforming symmetric encryption. It was also found that the homomorphic encryption scheme does not significantly reduce the performance of plaintext aggregation"
    },
    {
      "title": "Evaluation and Analysis of a Software Prototype for Guidance and Implementation of a Standardized Digital Forensic Investigation Process",
      "abstract": "Performing a digital forensic investigation requires a standardized and formalized process to be followed. The authors have contributed to the creation of an international standard on digital forensic investigation process, namely ISO/IEC 27043:2015, which was published in 2015. However, currently, there exists no application that would guide a digital forensic investigator to implement such a standardized process. The prototype of such an application has been developed by the authors and presented in their previous work. The prototype is in the form of a software application which has two main functionalities. The first functionality is to act as an expert system that can be used for guidance and training of novice investigators. The second functionality is to enable reliable logging of all actions taken within the investigation processes, enabling the validation of use of a correct process. The benefits of such a prototype include possible improvement in efficiency and effectiveness of an investigation and easier training of novice investigators. The last, and possibly most important benefit, includes that higher admissibility of digital evidence will be possible due to the fact that it will be easier to show that the standardized process was followed. This paper presents an evaluation of the prototype. Evaluation was performed in order to measure the usability and the quality of the prototype software, as well as the effectiveness of the prototype. The evaluation of the prototype consisted of two main parts. The first part was a software usability evaluation, which was performed using the Software Usability Measurement Inventory (SUMI), a reliable method of measuring software usability and quality. The second part of evaluation was in a form of a questionnaire set up by the authors, with the aim to evaluate whether the prototype meets its goals. The results indicated that the prototype reaches most of its goals, that it does have intended functionalities and that it is realatively easy to learn and use. Areas of improvement and future work were also identified in this work."
    },
    {
      "title": "Intrusion Detection in Bluetooth Enabled Mobile Phones",
      "abstract": "This paper presents a unified framework derived from extant opportunity-reducing techniques employed to mitigate the insider threat leveraging best practices. Although both motive and opportunity are required to commit maleficence, this paper focuses on the concept of opportunity. Opportunity is more tangible than motive; hence, it is more pragmatic to reflect on opportunity-reducing measures. Situational Crime Prevention theory is the most evolved criminology theory with respect to opportunity-reducing techniques. Hence, this theory will be the basis of the theoretical framework. The derived framework highlights several areas of research and may assist organizations in implementing controls that are situationally appropriate to mitigate insider threat."
    },
    {
      "title": "Location Aware Mobile Device Management",
      "abstract": "Mobile devices have created a situation where systemfocused security may not be sufficient in an environment where security requirements can change depending on the location of a mobile device.  The security on a network at a corporate company may be different in a boardroom, where sensitive information is discussed and acted upon, than at an employee’s desk, where the employee works with his normal line of business application.  The Neo Model is a conceptual model that describes a hypothetical black box, called the Neo device, which uses secure containers and mutual authentication to connect to specialised gateway controllers.  The gateway controllers have the ability to control and manage the Neo devices to ensure that specialised secure containers can be provisioned to Neo devices and activated or deactivated, depending on where the Neo device is physically located on the network.  The Neo Model allows companies to define security controls that is applicable depending on where the mobile device is located on the network."
    },
    {
      "title": "Mapping ‘Security Safeguard’ Requirements in a Data Privacy legislation to an International Privacy Framework- A Compliance Methodology",
      "abstract": "It is commonplace for organisations to collect personal information to be processed and stored on their systems. Until recently, there was no comprehensive legislation that addressed the ‘processing’ of personal information by organisations in South Africa. The Protection of Personal Information Bill (“POPI”) was signed into law in November 2013 and is expected to come into effect, later this year (2015). POPI is informed by international data privacy legislation. The implications are that it will be incumbent for organisations to revisit how they ‘handle’ peoples’ personal information. This can be a daunting task as evidenced by countries that still find it a challenge to comply with data privacy laws that have been enacted there, a while ago. This article proposes a methodology to comply with POPI. The Generally Accepted Privacy Principles (GAPP) is an American/Canadian framework containing international privacy requirements with best practices. Both, POPI and GAPP address a common purpose: ‘How personal information is collected, used, retained, disclosed, and disposed.’ GAPP is reputed as a solid benchmark for good privacy practice, comprising of ten overarching privacy principles which yields a set of criteria for effective management of privacy risks and compliance. Much of the provisions in POPI is addressed in GAPP. A key condition (Security Safeguards) in POPI stipulates what aspects of personal information must be adequately secured, with limited insight on how to go about this process. Accordingly, this article proposes a methodology to fill this gap. All of the provisions under ‘Security Safeguards’ in POPI is mapped onto GAPP, thereby contextualising GAPP to facilitate compliance with South Africa’s data privacy legislation and to the same end, complying with international privacy laws. This framework could also be implemented as a checklist/auditing document, guiding the organisation in its implementation of data privacy and POPI compliance."
    },
    {
      "title": "Playing Hide-and-Seek- Detecting the Manipulation of Android Timestamps",
      "abstract": "Mobile technology continues to evolve in the 21st century, providing users with improved capabilities and advance functionality. One of the leaders of this evolution is Android, a mobile operating system that continuously elevates existing features and offers new applications. Such improvements allowed Android to gain popularity worldwide. A combination of Android’s advance technology and increasing popularity allow smartphones supporting this operating system to become a rich source of trace evidence. Traces found on Android smartphones form a signi?cant part of digital investigations, especially when the user of the smartphone is involved in criminal activities. A key component of these traces is the date and time, often formed as timestamps. These timestamps allow the examiner to relate the tracesfoundonAndroidsmartphonestosomerealeventthattook place. Knowing when events occurred in digital investigations is of great importance to the overall success of the investigation. This paper introduces a new solution, called the Authenticity Framework for Android Timestamps (AFAT) that establishes the authenticity of timestamps found on Android smartphones. Currently the framework determines the authenticity of timestamps found in SQLite databases by following two individual methods. The ?rst method identi?es the presence of certain changes in the Android ?le system, which are indications of the manipulation of the SQLite databases. The second method subsequently focuses on the individual SQLite databases and the identi?cation of inconsistencies in these databases. The presence of speci?c ?le system changes as well as inconsistencies in the associated SQLite databases indicates that authenticity of the timestamps might be compromised. The results presented in the paper provide preliminary evidence that the suggested approach, Authenticity Framework for Android Timestamps, shows potential."
    },
    {
      "title": "Prerequisites for building a security incident response capability",
      "abstract": "There are a number of considerations before one can commence with establishing a Computer Security Incident Response Team (CSIRT). This paper presents the results of a structured literature review investigating the business requirements for establishing a CSIRT. That is, the paper identi?es those things that must be in place prior to commencing with the actual establishment process. These include characterising the CSIRT environment, funding, constituency, authority and legal considerations. Firstly, we identi?ed authoritative CSIRT literature.Thereafterweidenti?edsalientaspectsusingaconcept matrix. The study enumerates ?ve areas of primary business requirements.Finally,aholisticviewofthebusinessrequirements is provided by summarising the decisions required in each area."
    },
    {
      "title": "Protection of personal information in the South African Cloud Computing environment- A framework for Cloud Computing adoption",
      "abstract": "Cloud Computing has advanced to the point where it may be considered an attractive proposition for an increasing number of South African organizations, yet the adoption of Cloud Computing in South Africa remains relatively low. Many organizations are hesitant to adopt Cloud solutions due to a variety of inhibiting factors and concerns that lead to the mistrust in Cloud Computing. One of the major concerns identified is information security within the Cloud Computing environment. The approaching commencement of new information security legislation in South Africa, known as the Protection of Personal Information Act (POPI), may provide an ideal opportunity to address the information security-related concerns and foster a trust relationship between potential Cloud users and Cloud providers. POPI applies to anyone who processes personal information and regulates how they must handle, store and secure that information. Cloud providers who can demonstrate that they protect personal information may be more trustworthy and therefore more attractive to potential Cloud users. This paper discusses a proposed Framework for Cloud Computing Adoption which could assist South African Cloud providers in approaching compliance with the POPI Act, providing transparency and accountability to potential Cloud users, fostering a trust relationship and ultimately promoting the adoption of Cloud Computing in South Africa."
    },
    {
      "title": "Risk-Driven Security Metrics Development for an e-Health IoT Application",
      "abstract": "Security and privacy for e-health Internet-of-Things applications is a challenge arising due to the novelty and openness of the solutions. We analyze the security risks of an envisioned e-health application for elderly persons’ day-to-day support and chronic disease self-care, from the perspectives of the service provider and end-user. In addition, we propose initial heuristics for security objective decomposition aimed at security metrics definition. Systematically defined and managed security metrics enable higher effectiveness of security controls, enabling informed risk-driven security decision-making."
    },
    {
      "title": "Robustness of Computational Intelligent Assurance Models When Assessing e-Commerce Sites",
      "abstract": "E-commerce assurance platforms continue to emerge in order to facilitate trustworthy transactional relationships between buyers and sellers. However, as the sophistication of the e-commerce environments increase, the risks associated with transacting online also increase which pose a challenge to consumers to freely transact online. Although traditional assurance models are still used by various e-commerce sites, some of these models are not robust enough to provide adequate assurance on key areas of customer concerns in the cyber space. This research proposes a robust intelligent PRAHP framework built on Analytical Hierarchy Process complemented with an evidential reasoning from page ranking. PRAHP algorithms are modularised to run concurrently whose consensus decision takes place in a decision table. PRAHP objectively extracts real-life data directly from each of the 10 e-commerce websites comparatively using assurance attributes: Advanced Security, Policy, Advanced ISO, Advanced legislation and Availability. The assurance of e-commerce sites using PRAHP was experimented on small and large e-Commerce enterprises and validated by determining the effects of varied damping factor d on PRAHP, and comparing with customer’s site perceptions. The experimental results demonstrate that the proposed framework is sufficiently robust for current site assurance applications and shows the trustworthiness aspect of the framework in instances of uncertainty."
    },
    {
      "title": "Self-sanitization of digital images using steganography",
      "abstract": "Sanitization of an image is a process where certain areas of an image are removed to keep the contents safe from unauthorised viewers.  Image sanitization is often required by authorities, for example law enforcement or in legal cases, when the image contains sensitive material that should not be shown to the general public.  This paper proposes a system for the selfsanitization of a digital image using information hiding, specifically image steganography, techniques to hide part of the image within the image itself.  The proposed self-sanitization system allows for the removal of a specific part of the image and then uses Least Significant Bit (LSB) steganography to embed the sanitized part of the image within the rest of the image, making it unnecessary to store the sanitized and unsanitized versions of the image separately.  The self-sanitization system includes a method for reducing the size of the embedded information in an attempt to make the information more difficult to detect.  Experimental results show that the proposed self-sanitization system is undetectable to visual and statistical analysis techniques."
    },
    {
      "title": "SMT-Constrained Symbolic Execution Engine for Integer Overflow Detection in C Code",
      "abstract": "A sentiment that is quite often encountered in database forensic research material is the scarcity of scienti?c research in this vital area of digital forensics. Databases have been around for many years in the digital space and have moved from being exclusively used in specialised applications of big corporations to becoming a means to an end in even the simplest end-user applications. Newer disciplines such as cloud forensics seem to be producing a far greater volume of new research material than database forensics. This paper ?rstly investigates the validity of the expressed sentiment. It also attempts to establish possible reasons for the apparent lack of research in this area. A survey was conducted of scienti?c research material that was published after an initial assessment was performed in 2009. The gathered database forensic material was compared to scienti?c material published in the same period in the cloud forensic discipline. The survey indicated that the speed of research into database forensics has increased since the 2009 paper. However the area of cloud forensics has produced twice the amount of new research in the same time period. The factors that made cloud forensics an attractive research area are either not applicable to database forensics or no longer play a signi?cant role. This would explain the lesser interest in performing research in database forensics."
    },
    {
      "title": "State-on-nationals' electronic communications surveillance in South Africa- a murky legal landscape to navigate",
      "abstract": "The discussion concerns itself with state-on-nationals’ electronic communication surveillance in South Africa. The 2013 Snowden revelations of collaboration between the United States National Security Agency and the United Kingdom Government Communications Headquarters conducting bulk surveillance of all people as well as the 2015 South African spy cable disclosures involving communications between the South African State Security Agency and other foreign intelligence agencies confirmed that surveillance technology provides for covert, mass and undiscriminating government surveillance of nationals and states. Although the latter surveillance was conducted for national security purposes, government agencies also conduct surveillance for law enforcement purposes. The question pertaining to this discussion is whether information of South African nationals is lawfully accessed and/or retained in terms of a legal framework. This should include effective checks and balances, accountability and transparency to ensure that the information gathered is effectively protected against abuse such as its utilization for means other than the original purpose for which it was accessed and/or retained. Another concern is whether different thresholds apply to the purposes in conducting state electronic communications’ surveillance. The aim of the discussion is not to vilify government surveillance practices as governments carry the onerous task of protecting nationals against threats within the ever-advancing electronic communication technology medium. The aim is rather to establish whether there exist voids and/or deficiencies and if affirmative, how it could be addressed to ensure an open and transparent surveillance landscape aimed at striking a balance between security and human rights protection."
    },
    {
      "title": "The adversarial threat posed by the NSA to the integrity of the internet",
      "abstract": "In 2013 Edward Snowden a NSA Contractor leaked thousands of highly classified documents about the activities of the USA's National Security Agency (NSA) and its foreign intelligence partners known as the \"Five Eyes\". The documents revealed secret programs about the NSA's mass bulk collection of phone internet and communications traffic as well as how the NSA and its partners are working to sabotage and weaken encryption algorithms and the security protocols used to secure the internet. This paper presents some of the programs that were revealed as well as the rationale and legislation behind these programs from a global perspective. Mass surveillance is not only done by the Five Eyes partners but also by many other countries who pay private companies to provide them with tools to spy, censor and repress their own citizens. In order to assess the potential harm and the security implications of mass surveillance this paper looks at how state level actors around the world are conducting surveillance which raise broader issues about internet security such as how common weaknesses are being exploited by both intelligence agencies and criminals. This paper will also explore various technologies and techniques that can be used by both individuals and companies to secure themselves against mass surveillance."
    },
    {
      "title": "The Current State of Digital Forensic Practitioners in South Africa",
      "abstract": "Recent high profile court trials around the world, including South Africa, have highlighted the importance of forensic science evidence in court. They have also show what can happen when forensic science is handled poorly in court leading to incorrect convictions or acquittals. Most often the problems have been linked to the qualifications, training, competency and experience of the forensic practitioners who examined and analysed the evidence. With digital forensics being recognised as a forensics science and criminal trials such as Casey Anthony and Julia Amero dominated by errors in the digital forensics process attributed to the examiners, it is crucial to understand what the current situation is in South Africa with regards local digital forensic practitioners, so as to identify any strengths or shortcomings which could impact on digital evidence in a court of law. The research focused on understanding the academic qualifications, digital forensics training, competency, and experience of South African digital forensic practitioners. General trends were identified through the research showing that South African digital forensic practitioners often lacked the necessary academic qualifications, training, competency and experience required of a digital forensics practitioner, raising concerns about the quality of digital forensics practice in South Africa. When contrasted against international standards, the research identified areas of improvement, and suggested potential remedial actions to address the situation."
    },
    {
      "title": "The Effects of the PoPI Act on Small and Medium Enterprises in South Africa",
      "abstract": "The Protection of Personal Information PoPI Act was created to promote the constitutional right to privacy in South Africa by safeguarding personal identifiable information PII. This Act respects the right to privacy of customers and employees and also acknowledges the need for businesses to collect and use personal information. Having this type of legislation in place is without a doubt very beneficial to most individuals. However the effects that the PoPI Act will have on South African small to medium enterprises SMEs have not been explored in detail. Current practices such as direct marketing are perceived as a cost effective option for driving sales in SMEs and this option will largely be removed once PoPI is in effect. The POPI Act is a substantial piece of legislation with complex intricacies not easily understood. This complexity adds on to the difficulty SMEs experience when attempting to comply with the Act. Irrespective of the complexity PoPI is not something that can be ignored and a data information privacy regulator has been established by government. All business owners not just of big companies need to comply with this Act or face significant consequences. The regulators will be looking to make examples of organisations not complying and it is of utmost importance to ensure compliance or face the consequences. This paper explores the possible effects of the PoPI Act on SMEs in South Africa focusing in particular on the marketing strategies used by surveyed SMEs. It also investigates the current compliance of SMEs and reasons why SMEs are battling to comply."
    },
    {
      "title": "The Use of Web Beacons To Uniquely Identify a Website",
      "abstract": "This article relates to the field of digital forensics with a particular focus on web (World Wide Web) beacons and how they can be utilized for digital forensic purposes. A web beacon or more commonly “web bug” is an example of a hidden resource reference in a webpage, which when the webpage is loaded, is requested from a third party source.  The purpose of a web beacon is to track the browsing habits of a particular IP address. This paper proposes a novel technique that utilizes the presence of web beacons to create a unique ID for a website, to test this a practical investigation is performed. The practical investigation involves an automated scanning of web beacons on a number of websites, this scanning process involves identifying which beacons are present on a web page and recording the presence of those beacons, the results of this scanning process is then encoded into a table for human analyses. The result of the investigation show promise and incentivizes further research. Real world implications, future work and possible Improvements on the methods which were used in this study are finally discussed."
    },
    {
      "title": "Towards a digital forensic science",
      "abstract": "The scientific principles that underlie digital forensic science are still not clear.Possible foundations have been proposed by Gladyshev, Carrier, Cohen, The Scienti?c Working Group on Digital Evidence of the US Department of Justice and others. However, all these proposals, although valuable contributions, do not provide a satisfactory scienti?c basis. The current article argues that the search for a suitable foundation is hampered by the con?ation of science used for investigative purposes and science used for probative purposes. We argue that some aspects of forensic science are indeed useful for both purposes, but that large portions of the application of science for use in matters of law are only applicable to one of these categories. The paper focuses on the probative use of science for matters of law. We suggest that the explicit focus on proof (rather than investigation) leads to a clearer understanding of the notion of the claims to be proven. Based on this it is shown that such claims may be expressed as propositions that can be proven, disproven, or determined to be ambiguous given the available evidence using well-known computing concepts. It also indicates how this approach helps one to determine the accuracy (which will not always be the opposite of error rates) of any ?ndings. Given its speci?c focus the paper establishes a basis for digital forensic science without asserting that it is the only possible scienti?c basis."
    },
    {
      "title": "Towards a PHP Webshell Taxonomy using Deobfuscation-assisted Similarity Analysis",
      "abstract": "The abundance of PHP-based Remote Access Trojans(orwebshells)foundinthewildhasledmalwareresearchers to develop systems capable of tracking and analysing these shells. In the past, such shells were ably classi?ed using signature matching, a process that is currently unable to cope with the sheer volume and variety of web-based malware in circulation. Although a large percentage of newly-created webshell software incorporates portions of code derived from seminal shells such as c99 and r57, they are able to disguise this by making extensive use of obfuscation techniques intended to frustrate any attempts to dissect or reverse engineer the code. This paper presentsanapproachtoshellclassi?cationandanalysis(basedon similarity to a body of known malware) in an attempt to create a comprehensive taxonomy of PHP-based web shells. Several different measures of similarity were used in conjunction with clustering algorithms and visualisation techniques in order to achieve this. Furthermore, an auxiliary component capable of syntactically deobfuscating PHP code is described. This was employed to reverse idiomatic obfuscation constructs used by software authors. It was found that this deobfuscation dramatically increased the observed levels of similarity by exposing additional code for analysis."
    },
    {
      "title": "Unsolicited Short Message Service Marketing- A Preliminary Investigation into Individual Acceptance, Perceptions of Content, and Privacy Concerns",
      "abstract": "In an attempt to reach potential clients, many companies make use of targeted and sometimes unsolicited Short Message Service (SMS) marketing campaigns. With global perception of privacy principles and legislation increasing, a company engaging in such activities may unknowingly create a negative perception and/or sentiment, thereby actively discouraging potential consumers to transact with them. In this paper we report on the results of a preliminary research effort that investigated individual perceptions, acceptance and concerns about mobile marketing in the South African context. Making use of simple descriptive analysis techniques, we describe and highlight emerging themes identi?ed from data collected in an online survey questionnaire. Despite a small sample of n=44, and for various reasons, the results demonstrate a lack of consumer awareness of the law, is suggestive of a largely negative attitude towards mobile marketing campaigns, and highlights their continued efforts to control and manage privacy. There against the results suggest that users may neglect their own privacy if the content is crafted correctly. In an environment where it appears that little is being done to enforce/comply with the provisions of legislation, local companies may also be aware of the extent to which they can manipulate the law even if it increases non-acceptance of mobile marketing. As such, ample scope for further research is created."
    }
  ]
}